Repository: lab-neuro-comp/Test-Platform
Catalog: StroopTest/Resources/Localizations/LocalizedResources.*.resx
Languages: es_es, pt_br

# TRConfigInstructions
source: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <th class = "mainBar" colspan = "2">General</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Options</th> <th class = "subBar">Description</th> </tr> <tr> <td>Program name</td> <td>It should be filled in with the name of the program that will be created. The name must contain only alphanumeric characters and should not contain any space. This same name will be used when choosing the program to be executed on the results and import / export page</td> </tr> <td colspan = "2" style = "background: #fff"> </td> <tr> <th class = "mainBar" colspan = "2">Exposition</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Options</th> <th class = "subBar">Description</th> </tr> <tr> <tr> <td>Stimulus type</td> <td> In this field you must choose one of the types of stimulus available, they are: <br> <ul> <li> Shapes: In this mode, one or more geometric shapes in the "Shapes" field must be chosen, and these shapes will be rendered randomly during the exposure. In addition to the geometric form (s) a color / color list must be chosen which will define the color (s) of the geometric shape. </ Li> <li> Word: In this mode a list of words and a list of colors or a single color for the word must be chosen, and from this the program will display the colored words </ li> <li> Image: In this type a list of images must be chosen and from there the program will expose the images contained in the list. </ li> <li> Image and word: In this type should be chosen a list of images and one of words. The generated program will alternately display one item from each list at a time. </ Li> <li> Word with audio: This type should select a list of words and an audio list that will be played by the program in the display of colored words with audio exposure. </ li> <li> Image with audio: In this type you should select a list of images and another list of audio that will be played by the program. The exhibition </ li> </ ul> </td> </tr> <tr> <td> Stimulus size </td> <td> The size of the stimulus has different functions depending on the stimulus to which it applies. <ul> <li> Shapes: In this type of stimulus the size equals the shape size, in pixels, that will be rendered </ li> <li> Word: In this type of stimulus, the size equals the font size, in pixels, of the text to be rendered </ li> <li> Image: In this type of animation, the size is the size of the pixel side of the image to be rendered. </ li> </ ul> </td> </tr> <tr> <td> Font size </td> <td> The font size, in points, that will be used in words. </td> </tr> <tr> <td>Distance from the stimulus to the center of the screen</td> <td>It indicates, in pixels, the distance that the stimulus will be rendered taking as reference the center of the screen.</td> </tr> <tr> <td>Number of possible positions</td> <td> It indicates the number of possible positions for the stimulus and they are: <ul> <li> 1: In this option all the stimuli will appear in the center of the screen. </ li> <li> 2: In this option the stimuli can appear on the right of the screen or on the left. </ li> <li> 4: In this option the stimuli can appear in the positions: below the center, above the center, to the right of the center or to the left of the center. </ li> <li> 8: In this option the stimuli can appear in the positions: below the center, above the center, to the right of the center, to the left of the center or to any of the diagonals. </ li> </ ul> </td> </tr> <tr> <td>Number of attempts</td> <td>Sets the amount of user attempts. The number of attempts is equal to the number of stimuli that will be shown. <br> When the number of items in the lists is less than the number of attempts, the number of items in the lists will be used, repeating the items necessary to reach the number of attempts . Likewise, when the number of items in the lists is greater than the number of attempts, the number of items in the lists corresponding to the number of attempts will be used.</td> </tr> <tr> <td> Random order </td> <td> Indicates whether the exposure of the stimuli will be made randomly in relation to the order of the list. </td> </tr> <tr> <td> Use beep </td> <td> Indicates whether a beep will be played together with the rendering of the stimulus. </td> </tr> <tr> <td> Random beep </td> <td> Indicates whether the beep will be random. If it is random, it will only play in some renderings, if it is not random, it will play in all the stimuli. </td> </tr> <tr> <td> Beep duration (ms) </td> <td> Indicates by how many milliseconds the beep will play </td> </tr> <tr> <td> Type of color of the stimulus </td> <td> Indicates whether the stylus should have a single color throughout the program (Single Color) or whether it will be several different colors. In the case of several different colors these colors must be within a color list. </td> </tr> <tr> <td> Stimulus color </td> <td> Indicates the color of the stimulus. </td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Lists</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Options</th> <th class = "subBar">Description</th> </tr> <tr> <td> Words </td> <td> Loads the list of words that will be displayed for the types "Word", "Word and Image" and "Word with Audio". Non-random display will follow the order of the words in the list. </td> </tr> <tr> <td>Colors</td> <td>Loads the color list of the words that will be displayed for the types "Shapes", "Word", "Word and Image" and "Word with Audio". Non-random exposure will follow the order of the colors in the list.</td> </tr> <tr> <td>Images</td> <td>Loads the list of images that will be displayed for the types "Image", "Image with Audio" and "Word and Image". Non-random exposure will follow the order of the images in the list.</td> </tr> <tr> <td>Audios</td> <td>Loads the list of audios that will be played in the test for the "Audio Word" and "Audio Picture" types. Non-random exposure will follow the order of the audios in the list.</td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Time </th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Options</th> <th class = "subBar">Description</th> </tr> <tr> <td> Exposition(ms) </td> <td> Sets the duration in milliseconds of the chosen stimulus exposure, word or image. </td> </tr> <tr> <td>Interval(ms)</td> <td>Sets the time in milliseconds between attempts.</td> </tr> <tr> <td>Variable Interval Time</td> <td>Indicates that the interval will have the duration varied randomly from 400ms to the interval time reported.</td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Forms</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Options</th> <th class = "subBar">Description</th>> </tr> <tr> <td>Forms</td> <td>Indicates which geometric shapes will be used in the program of type "shapes"</td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">FixPoint </th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Options</th> <th class = "subBar">Description</th> </tr> <tr> <td>Type</td> <td>Indicates the shape of the fixing point: + or ·</td> </tr> <tr> <td>Fixpoint Color</td> <td>Indicates the color of the fixation point.</td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">User answers</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Options</th> <th class = "subBar">Description</th> </tr> <tr> <td>User response</td> <td>Indicates which keys the user will press to respond to the stimulus.</td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Others</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Options</th> <th class = "subBar">Description</th> </tr> <tr> <td>Background color</td> <td>Sets the color screen behind the stimulus during the presentation. The default is white screen.</td> </tr> <tr> <td>Instructions</td> <td>Describes the guidelines for the participant on the test run. Each displayed line will be displayed on a screen for 4 seconds.</td> </tr> </table> </body> </html>
pt_br: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <th class = "mainBar" colspan = "2">Geral</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Nome do programa</td> <td>Deve ser preenchido com o nome do programa que será criado. O nome deve conter apenas caracteres alfanuméricos e não deve possuir espaço. Esse mesmo nome será utilizado na hora de escolher o programa que será execultado, na página de resultados e importação/exportação</td> </tr> <td colspan = "2" style = "background: #fff"> </td> <tr> <th class = "mainBar" colspan = "2">Exposição</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <tr> <td>Tipo de estimulo</td> <td> Nesse campo deve ser escolhido um dos tipos de estimulo disponíveis, são eles:<br> <ul> <li>Formas: Nesse modo deve ser escolhido uma ou mais forma geometrica presente no campo "Formas", e essas formas serão renderizadas aleatoriamente durante a exposição. Além da(s) forma(s) geométrica(s) deve ser escolhida uma cor/uma lista de cores que definirá a(s) cor(es) da forma geométrica.</li> <li>Palavra: Nesse modo deve ser escolhido uma lista de palavras e uma lista de cores ou uma única cor para a palavra, e a partir disso o programa realizará a exposição de palavras coloridas</li> <li>Imagem: Nesse tipo deve ser escolhido uma lista de imagens e a partir disso o programa realizará a exposição das imagens contidas na lista.</li> <li>Imagem e palavra: Nesse tipo deve ser escolhido uma lista de imagens e uma de palavras. O programa gerado exibirá alternadamente um item de cada lista por vez.</li> <li>Palavra com áudio: Nesse tipo deve ser selecionado uma lista de palavras e outra de áudio que serão reproduzidos pelo programa na exposição de palavras coloridas com exposição de áudio.</li> <li>Imagem com áudio: Nesse tipo deve ser selecionado uma lista de imagens e outra de áudio que serão reproduzidos pelo programa. A exposição </li> </ul> </td> </tr> <tr> <td> Tamanho do estimulo </td> <td> O tamanho do estimulo possuí funções diferentes dependendo do estimulo a que ele se aplica. <ul> <li>Formas: Nesse tipo de estimulo o tamanho equivale ao tamanho da forma, em pixels, que será renderizado</li> <li>Imagem: Nesse tipo de estimulo o tamanho equivale ao tamanho do lado, em pixels, da imagem que será renderizada.</li> </ul> </td> </tr> <tr> <td> Tamanho da fonte </td> <td> O tamanho, em pontos, da fonte que será utilizada nas palavras. </td> </tr> <tr> <td>Distância do estimulo ao centro da tela</td> <td>Indica, em pixels a distância que o estímulo será renderizado tomando como referencia o centro da tela.</td> </tr> <tr> <td>Quantidade de possíveis posições</td> <td> Indica a quantidade de posições possiveis para o estimulo e são elas: <ul> <li>1: Nessa opção todos os estímulos aparecerão no centro da tela.</li> <li>2: Nessa opção os estímulos podem aparecer na direita da tela ou na esquerda.</li> <li>4: Nessa opção os estímulos podem aparecer nas posições: abaixo do centro, acima do centro, à direita do centro ou à esquerda do centro.</li> <li>8: Nessa opção os estímulos podem aparecer nas posições: abaixo do centro, acima do centro, à direita do centro, à esquerda do centro ou em qualquer uma das diagonais.</li> </ul> </td> </tr> <tr> <td>Número de tentativas</td> <td>Define a quantidade de tentativas do úsuario. O número de tentativas equivale ao número de estimulos que serão mostrados.<br>Quando o número de itens nas listas é menor que o número de tentativas, será utilizada a quantidade de itens das listas repetindo os itens o necessário para atingir o número de tentativas. Da mesma forma, quando o número de itens nas listas é maior que o número de tentativas, será utilizada a quantidade de itens das listas correspondente ao número de tentativas. </td> </tr> <tr> <td> Ordem aleatória </td> <td> Indica se a exposição dos estímulos será feita de forma aleatória em relação a ordem da lista. </td> </tr> <tr> <td> Utilizar beep </td> <td> Indica se será reproduzido um beep juntamente com a renderização do estimulo. </td> </tr> <tr> <td> Beep aleatório </td> <td> Indica se o beep será aleatório. Caso seja aleatório ele será reproduzido apenas em algumas renderizações, caso não seja aleatório ele será reproduzido em todos os estimulos. </td> </tr> <tr> <td> Duração do beep(ms) </td> <td> Indica por quantos milisegundos o beep será reproduzido </td> </tr> <tr> <td> Tipo de cor do estímulo </td> <td> Indica se o estílo deve ter uma única cor durante todo o programa (Cor única) ou se serão várias cores diferentes. No caso de várias cores diferentes essas cores devem estar dentro de uma lista de cores. </td> </tr> <tr> <td> Cor do estimulo </td> <td> Indica a cor do estimulo. </td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Listas </th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td> Palavras </td> <td> Carrega a lista de palavras que serão apresentadas para os tipos "Palavra", "Palavra e Imagem" e "Palavra com Áudio". A exposição não aleatória seguirá a ordem das palavras na lista. </td> </tr> <tr> <td>Cores</td> <td>Carrega a lista de cores das palavras que serão apresentadas para os tipos "Formas", "Palavra", "Palavra e Imagem" e "Palavra com Áudio". A exposição não aleatória seguirá a ordem das cores na lista.</td> </tr> <tr> <td>Imagens</td> <td>Carrega a lista de imagens que serão apresentadas para os tipos "Imagem", "Imagem com Áudio" e "Palavra e Imagem". A exposição não aleatória seguirá a ordem das imagens na lista.</td> </tr> <tr> <td>Áudios</td> <td>Carrega a lista de áudios que serão reproduzidos no teste para os tipos "Palavra com Áudio" e "Imagem com Áudio". A exposição não aleatória seguirá a ordem dos áudios na lista.</td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Tempo </th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td> Exposição(ms) </td> <td> Define a duração em milissegundos da exposição do estímulo escolhido, palavra ou imagem. </td> </tr> <tr> <td>Intervalo(ms)</td> <td>Define o tempo em milissegundos entre as tentativas.</td> </tr> <tr> <td>Tempo Intervalo Variável </td> <td>Indica que o intervalo terá a duração variada aleatoriamente a partir de 400ms até o tempo de intervalo informado.</td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Formas</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Formas</td> <td>Indica quais formas geométricas serão utilizadas no programa do tipo "formas"</td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Ponto de fixação </th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Tipo</td> <td>Indica a forma do ponto de fixação: + ou ・</td> </tr> <tr> <td>Cor do ponto</td> <td>Indica a cor do ponto de fixação.</td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Resposta do usuário</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Resposta do usuário</td> <td>Indica quais serão as teclas que o usuário pressionará para responder aos estimulos.</td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Outros </th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Cor de Fundo </td> <td>Define a cor tela por trás do estímulo durante a apresentação. O padrão é tela branca.</td> </tr> <tr> <td>Instruções </td> <td>Descreve as orientações para o participante sobre a execução do teste. Cada linha informada será apresentada em uma tela durante 4 segundos.</td> </tr> </table> </body> </html>
