Repository: lab-neuro-comp/Test-Platform
Catalog: StroopTest/Resources/Localizations/LocalizedResources.*.resx
Languages: es_es, pt_br

# TRResultsInstructions
source: <!DOCTYPE html> <html>a <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">General</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Option</th> <th class = "subBar">Description</th> </tr> <tr> <td>Export as .cvs</td> <td>It exports the results to a file with values separated by comma, which can be opened by spreadsheet editors programs (ex: libre office).</td> </tr> <tr> <th class = "mainBar" colspan = "2">Results</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Option</th> <th class = "subBar">Description</th> </tr> <tr> <td>program</td> <td>Indicates the name of the program that was running at the time of the stimulus.</td> </tr> <tr> <td>Participant</td> <td>Shows the user name</td> </tr> <tr> <td>Date</td> <td>Indicates the that date the program was run</td> </tr> <tr> <td>Starting time</td> <td>Indicates the exact moment the user started the test</td> </tr> <tr> <td>Exhibition time</td> <td>Indicates the exact moment when the exposure occurred</td> </tr> <tr> <td>TR(ms)</td> <td>Indicates the reaction time of the user to the stimulus shown, which can be negative in case of anticipation of the response, zero if there was no reaction to the stimulus or positive if there was a reaction in time.</td> </tr> <tr> <td>Interva(ms)</td> <td>Elapsed time between the stimulus shown and the next, and may be random or not according to the configuration of the program, except in case of anticipation of the response of the user to the stimulus or if there is no reaction to the stimulus(ms)</td> </td> </tr> <tr> <td>Estimated Interval(ms)</td> <td>Elapsed time between the stimulus shown and the next, which may be random or not according to the program configuration</td> </tr> <tr> <td>Exposure time(ms)</td> <td>Moment in which the stimulus was shown having as reference the beginning of the execution of the program.</td> </tr> <tr> <td>Exposition(ms)</td> <td>Indicates how long the exposure has appeared (if user responds the total exposure time is equivalent to the reaction time)</td> </tr> <tr> <td>Sequence</td> <td>Indicates the chronological order in which the stimulu appeared for the user</td> </tr> <tr> <td>Position</td> <td>Indicates in which position the stimulus was rendered</td> </tr> <tr> <td>User answer</td> <td>Indicates which key was pressed by the user to respond to the stimulus</td> </tr> <tr> <td>Stimulus type</td> <td>Indicates which type of stimulus was shown to the user</td> </tr> <tr> <td>Stimulus</td> <td>Indicates the name of the stimulus that was displayed to the user</td> </tr> <tr> <td>Stimulus color</td> <td>Indicates the color that the stimulus appeared to the user</td> </tr> <tr> <td>Beep</td> <td>Indicates whether or not the beep was rendered when rendering the stimulus</td> </tr> </table> </body> </html>
pt_br: <!DOCTYPE html> <html>a <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Geral</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Exportar como .cvs</td> <td>Exporta os resultados para um arquivo com valores separados por vigula, que podem ser abertos por programas editores de planilhas (ex: libre office).</td> </tr> <tr> <th class = "mainBar" colspan = "2">Resultados</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>programa</td> <td>Indica o nome do programa que estava sendo executado no momento do estimulo.</td> </tr> <tr> <td>Participante</td> <td>Indica o nome do participante</td> </tr> <tr> <td>Data</td> <td>Indica a data em que o programa foi executado</td> </tr> <tr> <td>Horario inicial</td> <td>Indica o exato momento em que o usuário iniciou o teste</td> </tr> <tr> <td>Horario Exposição</td> <td>Indica o exato momento em que a exposição ocorreu</td> </tr> <tr> <td>TR(ms)</td> <td>Indica o tempo de reação do usuário ao estimulo mostrado, podendo ser negativo em caso de antecipação da resposta, zero se não houve reação ao estimulo ou positivo se houve reação a tempo.</td> </tr> <tr> <td>Intervalo(ms)</td> <td>Tempo decorrido entre o estímulo mostrado e o próximo, podendo ser aleatório ou não de acordo com a configuração do programa, exceto em caso de antecipação da resposta do usuário ao estímulo ou caso não haver reação ao estimulo </td> </tr> <tr> <td>Intervalo estimado(ms)</td> <td>Tempo decorrido entre o estímulo mostrado e o próximo, podendo ser aleatório ou não de acordo com a configuração do programa</td> </tr> <tr> <td>Exposição tempo(ms)</td> <td>Momento em que o estímulo foi mostrado tendo como referência o inicio da excecução do programa.</td> </tr> <tr> <td>Exposição(ms)</td> <td>Indica por quanto tempo a exposição apareceu (caso haja resposta do usuário o tempo total de exposição é equivalente ao tempo de reação)</td> </tr> <tr> <td>Sequência</td> <td>Indica a ordem cronológica em que os estímulos apareceram para o usuário</td> </tr> <tr> <td>Pos</td> <td>Indica em qual posição o estimulo foi renderizado</td> </tr> <tr> <td>Resposta usuario</td> <td>Indica qual a tecla que foi pressionada pelo usuário para responder ao estimulo</td> </tr> <tr> <td>Tipo estimulo</td> <td>Indica qual tipo de estimulo foi exibido ao usuário</td> </tr> <tr> <td>Estimulo</td> <td>Indica o nome do estimulo que foi exibido ao usuário</td> </tr> <tr> <td>Cor do estimulo</td> <td>Indica a cor que o estimulo apareceu ao usuário</td> </tr> <tr> <td>Beep</td> <td>Indica se houve ou não o beep ao renderizar o estimulo</td> </tr> </table> </body> </html>

# experimentResultInstructions
source: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">General</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Option</th> <th class = "subBar">Description</th> </tr> <tr> <td>Export as .cvs</td> <td>It exports the results to a file with values separated by comma, which can be opened by spreadsheet editors programs (ex: libre office).</td> </tr> <tr> <th class = "mainBar" colspan = "2">Results</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Option</th> <th class = "subBar">Description</th> </tr> <tr> <td>experiment</td> <td>Indicates the name of the experiment that was run.</td> </tr> <tr> <td>program</td> <td>Indicates the name of the program that was running at the time of the stimulus.</td> </tr> <tr> <td>Participant</td> <td>Shows the user name</td> </tr> <tr> <td>Date</td> <td>Indicates the that date the program was run</td> </tr> <tr> <td>Starting time</td> <td>Indicates the exact moment the user started the <u>experiment</u></td> </tr> <tr> <td>test time</td> <td>Indicates the exact moment the user started the <u>program</u></td> <tr> <td>Sequence</td> <td>Indicates the chronological order in which the program appeared for the user</td> </tr> </table> </body> </html>
pt_br: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Geral</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Exportar como .cvs</td> <td>Exporta os resultados para um arquivo com valores separados por vigula, que podem ser abertis por programas editores de planilhas (ex: libre office).</td> </tr> <tr> <th class = "mainBar" colspan = "2">Resultados</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>experimento</td> <td>Indica o nome do experimento que foi executado.</td> </tr> <tr> <td>Programa</td> <td>Indica o nome do programa que foi executado</td> </tr> <tr> <td>Usuário</td> <td>Indica o nome do usuário que realizou o teste</td> </tr> <tr> <td>Data</td> <td>Indica a data em que o teste foi realizado</td> </tr> <tr> <td>Horario inicial</td> <td>Indica o exato momento em que o usuário iniciou o <u>experimento</u></td> </tr> <tr> <td>Horario teste</td> <td>Indica o exato momento em que o usuário iniciou o <u>programa</u></td> <tr> <td>Sequência</td> <td>Indica a sequência cronológica em que o programa foi executado</td> </tr> </table> </body> </html>

# deleteList
source: Are you sure that you want to delete all the selected lists?
pt_br: Você tem certeza que deseja excluir todas as listas selecionadas?

# listsDeleted
source: All selected lists were deleted sucessful!
pt_br: Todas as listas selecionadas foram excluídas com sucesso!

# listDeleteInstructions
source: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">General</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Option</th> <th class = "subBar">Description</th> </tr> <tr> <td>Existing lists</td> <td>Indicates the lists and the lists child files that currently exists.</td> </tr> <tr> <td>Files that will be removed</td> <td>Indicates the lists and the lists child files that will be removed.</td> </tr> </table> </body> </html>
pt_br: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Geral</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Listas existentes</td> <td>Indica as listas existentes e os arquivos pertencentes a ela.</td> </tr> <tr> <td>Arquivos que serão excluídos</td> <td>Indica o nome da lista que será excluída e os arquivos pertencentes a ela que também serão excluídos.</td> </tr> </table> </body> </html>

# importSuccess
source: Files were imported with success.
pt_br: Os arquivos foram importados com sucesso.

# agreeConditions
source: You have to agree with conditions to proceed.
pt_br: Você tem que concordar com as condições para continuar.

# fieldNotFilled
source: This field can't be left blank.
pt_br: Este campo não pode ser deixado em branco

# exportInstructions
source: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <th class = "mainBar" colspan = "2">General</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Option</th> <th class = "subBar">Description</th> </tr> <tr> <td>Existing files</td> <td>This field shows the lists, programs or experiments that exist and <u>can be exported</u></td> </tr> <tr> <td>Files being exported</td> <td>This list indicates which files exist and <u> will be exported</u></td> </tr> <tr> <td>Export</td> <td>Save all the lists, programs or experiments into a zip file, that can be imported from any computer</td> </tr> </table> </body> </html>
pt_br: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <th class = "mainBar" colspan = "2">Geral</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Arquivos existentes</td> <td>Essa lista mostra todos os programas, experimentos e listas que <u>podem ser exportados</u></td> </tr> <tr> <td>Arquivos sendo exportados</td> <td>Essa lista indica quais arquivos existem e<u> serão exportados</u></td> </tr> <tr> <td>Exportar</td> <td>Salva todos os arquivos selecionados em um arquivo zip, tornando possível a importação em qualquer computador</td> </tr> </table> </body> </html>

# importInstructions
source: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <th class = "mainBar" colspan = "2">General</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Option</th> <th class = "subBar">Description</th> </tr> <tr> <td>File</td> <td>Selects the zip file with lists, programs or experiments that will be imported</td> </tr> <tr> <td>Import all files</td> <td>Check this box if you want all programs in file to be imported</td> </tr> <tr> <td>Existing files</td> <td>This field shows the lists, programs or experiments that exist in the zip file and <u>can be imported</u></td> </tr> <tr> <td>Files being imported</td> <td>This list indicates which files<u> will be imported</u></td> </tr> <tr> <td>Import</td> <td>Save all the lists, programs or experiments from a zip file into the lists, programs or experiments directory, being possible to use them.</td> </tr> </table> </body> </html>
pt_br: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <th class = "mainBar" colspan = "2">Geral</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Arquivo</td> <td>Seleciona o arquivo zip contendo todas as listas, programas ou experimentos que serão importados</td> </tr> <tr> <td>Importar todos os arquivos</td> <td>Marque essa opção se deseja importar todos os arquivos do arquivo zip</td> </tr> <tr> <td>Arquivos existentes</td> <td>Esse campo mostra todos os programas, listas ou experimentos que<u>podem ser importados</u></td> </tr> <tr> <td>Arquivos que serão importados</td> <td>Essa lista indica quais arquvos<u> serão importados</u></td> </tr> <tr> <td>Importar</td> <td>Salva todos os arquivos selecionados, tornando possível sua utilização.</td> </tr> </table> </body> </html>

source: Create new list
pt_br: Criar nova lista

# audioRecordFailed
source: The file was generated but no audio was captured.
pt_br: O arquivo foi gerado porém nenhum áudio foi capturado.

# deleteFiles
source: Are you sure that you want to move all the selected lists?
pt_br: Você tem certeza que deseja mover todos os arquivos selecionados?

# listsNotDeleted
source: No list was deleted.
pt_br: Nenhuma lista foi excluída.

# listNotAlphanumeric
source: The list name must be composed only of alphanumerical characters and no spaces. Example: 'MyList'
pt_br: Nome da lista deve ser composto apenas de caracteres alfanuméricos e sem espaços. Exemplo: 'MinhaLista'

source: random
pt_br: Aleatório

source: Training
pt_br: Treino

# removeProgramFromExperiment
source: Wish to remove the program from the experiment?
pt_br: Deseja remover o programa do experimento?

# audioDeviceNotAvailable
source: There are no devices available to record audio.
pt_br: Não existe nenhum dispositivo disponível para gravação de aúdio.
