Repository: lab-neuro-comp/Test-Platform
Catalog: StroopTest/Resources/Localizations/LocalizedResources.*.resx
Languages: es_es, pt_br

# matchingResultsInstructions
source: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">General</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Option</th> <th class = "subBar">Description</th> </tr> <tr> <td>Export as .cvs</td> <td>It exports the results to a file with values separated by comma, which can be opened by spreadsheet editors programs (ex: libre office).</td> </tr> <tr> <th class = "mainBar" colspan = "2">Results</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Option</th> <th class = "subBar">Description</th> </tr> <tr><td>Program</td><td>The program name</td> </tr> <tr><td>Participant</td><td>The participant name</td> </tr> <tr><td>Date</td><td>Date that the program was executed</td> </tr> <tr><td>Initial Time</td><td>Time when the program was executed</td> </tr> <tr><td>Exposition Time</td><td>Time when the exposition was rendered</td> </tr> <tr><td>Model Reaction Time</td><td>Time that participant take to answer to the model</td> </tr> <tr><td>Stimulu Reaction Time(ms)</td><td>Time that participant take to answer to the stimulu</td> </tr> <tr><td>Interval between attempts(ms)</td><td>Time elapsed since last attempt</td> </tr> <tr><td>Interval(ms)</td><td>Interval between the model and the stimulus exposition</td> </tr> <tr><td>Model Exposition(ms)</td><td>Time that model stayed in screen</td> </tr> <tr><td>Stimulu Exposition(ms)</td><td>Time that stimulu stayed in screen</td> </tr> <tr><td>Senquency</td><td>Cronological order that stimulus appered to participant</td> </tr> <tr><td>Test Type</td><td>Test type of exposition</td> </tr> <tr><td>Stimulus Type</td><td>Stimulu type of exposition</td> </tr> <tr><td>List </td><td>Lists that was used in program</td> </tr> <tr><td>Model first position</td><td>Where the model appeared</td> </tr> <tr><td>Model </td><td>Name of the model</td> </tr> <tr><td>Model color</td><td>Color of the model</td> </tr> <tr><td>2nd Stimulu</td><td>Name of 2nd stimulu</td> </tr> <tr><td>3rd Stimulu </td><td>Name of 3rd stimulu</td> </tr> <tr><td>4th Stimulu </td><td>Name of 4th stimulu</td> </tr> <tr><td>5th Stumulu </td><td>Name of 5th stimulu</td> </tr> <tr><td>6th Stimulu </td><td>Name of 6th stimulu</td> </tr> <tr><td>7th Stimulu </td><td>Name of 7th stimulu</td> </tr> <tr><td>8th Stimulu </td><td>Name of 8th stimulu</td> </tr> <tr><td>Model second position</td><td>Where the model appeared as stimulu</td> </tr> <tr><td>Clicked Stimulu</td><td>Name of the stimulu that participant clicked</td> </tr> <tr><td>Clicked Stimulu Color</td><td>Color of the stimulu that participant clicked</td> </tr> <tr><td>Clicked Stimulu Position</td><td>Position of the stimulu that participant clicked</td> </tr> <tr><td>Match</td><td>User clicked the stimulu equals the model</td> </tr> </table> </body> </html>
pt_br: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">General</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Option</th> <th class = "subBar">Description</th> </tr> <tr> <td> Exportar como .cvs </td> <td> Exporta os resultados para um arquivo com valores separados por vírgula, que podem ser abertos por programas editores de planilhas (ex: libre office). </td> </tr> <tr> <th class = "mainBar" colspan = "2">Results</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Option</th> <th class = "subBar">Description</th> </tr> <tr> <td> Programa </td> <td> O nome do programa </td> </tr> <tr> <td> Participante </td> <td> O nome do participante </td> </tr> <tr> <td> Data </td> <td> Data em que o programa foi executado </td> </tr> <tr> <td> Hora Inicial </td> <td> Hora em que o programa foi executado </td> </tr> <t> <td> Tempo de exposição </td> <td> Tempo em que a exposição foi processada </td> </tr> <tr> <td> Tempo de Reação do Modelo </td> <td> Tempo que o participante leva para responder ao modelo </td> </tr> <tr> <td> Tempo de Reação do estimulo (ms) </td> <td> Tempo que o participante leva para responder ao estimulo </td> </tr> <tr> <td> Intervalo entre as tentativas (ms) </td> <td> Tempo decorrido desde a última tentativa </td> </tr> <tr> <td> Intervalo (ms) </td> <td> Intervalo entre o modelo e a exposição de estímulo </td> </tr> <tr> <td> Exposição do modelo (ms) </td> <td> Tempo em que o modelo ficou na tela </td> </tr> <tr> <td> estimulo Exposition (ms) </td> <td> Tempo que o estimulo ficou na tela </td> </tr> <tr> <td> Senecência </td> <td> Ordem cronológica que o estímulo veio para o participante </td> </tr> <tr> <td> Tipo de teste </td> <td> Tipo de teste de exposição </td> </tr> <tr> <td> Tipo de estímulo </td> <td> Tipo de exposição estimulo </td> </tr> <tr> <td> List </td> <td> Listas que foram usadas no programa </td> </tr> <tr> <td> Primeira posição do modelo </td> <td> Onde o modelo apareceu </td> </tr> <tr> <td> Modelo </td> <td> Nome do modelo </td> </tr> <tr> <td> Cor do modelo </td> <td> Cor do modelo </td> </tr> <tr> <td> 2º estimulo </td> <td> Nome do 2º estimulo </td> </tr> <tr> <td> 3º estimulo </td> <td> Nome do 3º estimulo </td> </tr> <tr> <td> 4º estimulo </td> <td> Nome do 4º estimulo </td> </tr> <tr> <td> 5º Stumulu </td> <td> Nome do 5º estimulo </td> </tr> <tr> <td> 6º estimulo </td> <td> Nome do 6º estimulo </td> </tr> <tr> <td> 7º estimulo </td> <td> Nome do 7º estimulo </td> </tr> <tr> <td> 8º estimulo </td> <td> Nome do 8º estimulo </td> </tr> <tr> <td> Segunda posição do modelo </td> <td> Onde o modelo apareceu como estimulo </td> </tr> <tr> <td> estimulo clicado </td> <td> Nome do estimulo em que o participante clicou </td> </tr> <tr> <td> Cor de estimulo clicado </td> <td> Cor do estimulo em que o participante clicou </td> </tr> <tr> <td> Posição de estimulo clicado </td> <td> Posição do estimulo em que o participante clicou </td> </tr> <tr> <td> Match </td> <td> Usuário clicou o estimulo igual ao modelo </td> </tr> </table> </body> </html>

# expandImageInvalid
source: Expanding image, there is only one position available, center.
pt_br: A expansão da imagem só pode ter uma posição, central.

source: Clicked Stimulu Position
pt_br: Posição do estimulo clicado

source: Model first position
pt_br: Primeira posição do modelo

source: Model second position
pt_br: Segunda posição do modelo

# invalidDate
source: A valid date must be choosen.
pt_br: Deve ser selecionada uma data válida.

# invalidSchoolingLevel
source: Select a level of schooling.
pt_br: Selecione um nível de escolaridade.

# invalidSex
source: Select a sex.
pt_br: Selecione um sexo.

# invalidYesNoPanel
source: Select yes or no.
pt_br: Selecione sim ou não.

# invalidName
source: You must type a name.
pt_br: Digite um nome.

# participantAlreadyExistsWishOverride
source: Participant with same identifier already exists. Wish to override?
pt_br: Participante já existe, deseja sobreescrever?

source: Participant not saved.
pt_br: Participante não foi salvo.

# participantSaveSucessful
source: The participant was saved sucessful.
pt_br: Participante salvo com sucesso.

source: Edit participant:
pt_br: Editar participante:

source: Create new participant
pt_br: Criar novo participante

# shouldCloseOpenedForm
source: You should close any opened form before continue.
pt_br: Você deve fechar qualquer formulário aberto antes de continuar

# shouldSelectReason
source: You should select a valid reason.
pt_br: Um motivo válido deve ser selecionado.

# alternatingDMTS_DNMTS
source: DMTS/DNMTS(Alternating)
es_es: DMTS/DNMTS(Alterno)
pt_br: DMTS/DNMTS(Alternado)

# randomDMTS_DNMTS
source: DMTS/DNMTS(Random)
es_es: DMTS/DNMTS(Aleatorio)
pt_br: DMTS/DNMTS(Aleatorio)

# version
source: Versão
es_es: Versión
