Repository: lab-neuro-comp/Test-Platform
Catalog: StroopTest/Resources/Localizations/LocalizedResources.*.resx
Languages: es_es, pt_br

# newAudioInstructions
source: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Auditions of Tests Display</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Option</th> <th class = "subBar">Description</th> </tr> <tr> <td>List</td> <td>This screen displays the audios recorded in the previously executed tests. The audios of the test execution will be recorded in a file named with the chosen program and the identification of the participant, if this combination has already occurred the new audios will be added to the same file.</td> </tr> <tr> <th class = "mainBar" colspan = "2">Creating audio files in WAV format</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Option</th> <th class = "subBar">Description</th> </tr> <td>Audio Creation</td> <td>In this screen it is possible to record WAV format audio files to be used as files in audio lists. Recording starts when you click the Record button and is finished and can be saved by the Stop / Save button</td> </tr> </tr> </table> </body> </html>
pt_br: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Exibição de Aúdios de Testes</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Lista</td> <td>Nessa tela são exibidos os aúdios gravados no decorrer de testes executados anteriormente. Os aúdios da execução do teste serão gravados em arquivo nomeado com o programa escolhido e a identificação do participante, caso já tenha ocorrido esta combinação os novos audios serão adicionados ao mesmo arquivo.</td> </tr> <tr> <th class = "mainBar" colspan = "2">Criação de arquivos de aúdio no formato WAV</th> </tr> <tr> <th class = "subBar">Opção</th> <th class = "subBar">Descrição</th> </tr> <td>Criação de áudio</td> <td>Nessa tela é possível a gravação de aúdios no formato WAV para serem utilizados como arquivos em listas de aúdio. A gravação inicia-se ao clicar no botão Gravar e é finalizada, podendo ser salva, no botão Parar/Salvar</td> </tr> </tr> </table> </body> </html>

# stroopConfigInstructions
source: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <th class = "mainBar" colspan = "2">General</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Options</th> <th class = "subBar">Description</th> </tr> <tr> <td>Program name</td> <td>It should be filled in with the name of the program that will be created. The name must contain only alphanumeric characters and should not contain any space. This same name will be used when choosing the program to be executed on the results and import / export page</td> </tr> <td colspan = "2" style = "background: #fff"> </td> <tr> <th class = "mainBar" colspan = "2">Exposition</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Options</th> <th class = "subBar">Description</th> </tr> <tr> <tr> <td>Stimulus type</td> <td> In this field you must choose one of the types of stimulus available, they are: <br> <ul> <li> Word: In this mode a list of words and a list of colors for the word must be chosen, and from this the program will display the colored words </li> <li> Image: In this type a list of images must be chosen and from there the program will expose the images contained in the list. </li> <li> Image and word: In this type should be chosen a list of images and one of words. The generated program will alternately display one item from each list at a time. </Li> <li> Word with audio: This type should select a list of words and an audio list that will be played by the program in the display of colored words with audio exposure. </li> <li> Image with audio: In this type you should select a list of images and another list of audio that will be played by the program.</li> </ul> </td> </tr> <tr> <td>Number of attempts</td> <td>Sets the amount of user attempts. The number of attempts is equal to the number of stimulus that will be shown. <br> When the number of items in the lists is less than the number of attempts, the number of items in the lists will be used, repeating the items necessary to reach the number of attempts. Likewise, when the number of items in the lists is greater than the number of attempts, the number of items in the lists corresponding to the number of attempts will be used.</td> </tr> <tr> <td> Random order </td> <td> Indicates whether the exposure of the stimulus will be made randomly in relation to the order of the list. </td> </tr> <tr> <td> Word size </td> <td> Indicates the font size of the text for "Word", "Word with audio" or "Image and word". The default size is 160. </td> </tr> <tr> <td> Word color </td> <td> Indicates the color of the word, for "Word and Image" or "Image and Word". The default color is black. </td> </tr> <tr> <td> Expand Image </td> <td> Sets the image expansion to the limit proportional to the screen. You can not simultaneously play the caption. </td> </tr> <tr> <td> Rotate Image </td> <td> Sets the image rotation at the angle and direction indicated in the list. </td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Lists </th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Options</th> <th class = "subBar">Description</th> </tr> <tr> <td> Words </td> <td> Loads the list of words that will be displayed for the "Word" and "Word with Audio" types. Non-random display will follow the order of the words in the list. </td> </tr> <tr> <td>Colors</td> <td>Loads the color list of words that will be displayed for the "Word" and "Word with Audio" types. Non-random exposure will follow the order of the colors in the list.</td> </tr> <tr> <td>Images</td> <td>Loads the list of images that will be displayed for the types "Image", "Image with Audio" and "Image and Word". Non-random exposure will follow the order of images in the list.</td> </tr> <tr> <td>Audios</td> <td>Loads the list of audios that will be played in the test for the "Audio Word" and "Audio Picture" types. Non-random exposure will follow the order of the audios in the list.</td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Time</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Options</th> <th class = "subBar">Description</th> </tr> <tr> <td> Exposition(ms) </td> <td> Sets the duration in milliseconds of the chosen stimulus exposure, word or image. </td> </tr> <tr> <td>Interval(ms)</td> <td>Sets the time in milliseconds between attempts.</td> </tr> <tr> <td>Variable Interval Time</td> <td>Indicates that the interval will have the duration varied randomly from 400ms to the interval time reported.</td> </tr> <tr> <td>Delay</td> <td>Sets the time in milliseconds between paired stimuli for the word, image, or word and image types. If not informed, interval time will be used.</td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Subtitle</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Options</th> <th class = "subBar">Description</th> </tr> <tr> <td>Enable</td> <td>Indicates whether the image display will have caption. When activating, it must be selected list of words to be displayed as caption.</td> </tr> <tr> <td>Color</td> <td>Indicates the color of the caption. The color black will be used, if not informed</td> </tr> <tr> <td>Position</td> <td>Indicates the location that the legend will be placed in relation to the stimulus: ←, on the left (pictures); ↑, above (words and pictures); → on the right (pictures); ↓, below (words and pictures); ·, To the center (images); Random, change apposition, according to the type of stimulus</td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Fix point</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Options</th> <th class = "subBar">Description</th> </tr> <tr> <td>Type</td> <td>Indicates the shape of the fixing point: + or ·</td> </tr> <tr> <td>Point Color</td> <td>Indicates the color of the fix point.</td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Others </th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Options</th> <th class = "subBar">Description</th> </tr> <tr> <td>Capture Audio during Play</td> <td>Indicates that the user's responses will be recorded automatically during execution. An audio file will be generated in the data folder. Requires the NAudio.dll file to be in the same folder as the test. The default is selected.</td> </tr> <tr> <td>Background color</td> <td>Sets the color screen behind the stimulus during the presentation. The default is gray screen.</td> </tr> <tr> <td>Instructions</td> <td>Describes the guidelines for the participant on the test run. Each displayed line will be displayed on a screen for 4 seconds.</td> </tr> </table> </body> </html>
pt_br: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <th class = "mainBar" colspan = "2">Geral</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Nome do programa</td> <td>Deve ser preenchido com o nome do programa que será criado. O nome deve conter apenas caracteres alfanuméricos e não deve possuir espaço. Esse mesmo nome será utilizado na hora de escolher o programa que será execultado, na página de resultados e importação/exportação</td> </tr> <td colspan = "2" style = "background: #fff"> </td> <tr> <th class = "mainBar" colspan = "2">Exposição</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <tr> <td>Tipo de estimulo</td> <td> Nesse campo deve ser escolhido um dos tipos de estimulo disponíveis, são eles:<br> <ul> <li>Palavra: Nesse modo deve ser escolhido uma lista de palavras e uma lista de cores para a palavra, e a partir disso o programa realizará a exposição de palavras coloridas</li> <li>Imagem: Nesse tipo deve ser escolhido uma lista de imagens e a partir disso o programa realizará a exposição das imagens contidas na lista.</li> <li>Imagem e palavra: Nesse tipo deve ser escolhido uma lista de imagens e uma de palavras. O programa gerado exibirá alternadamente um item de cada lista por vez.</li> <li>Palavra com áudio: Nesse tipo deve ser selecionado uma lista de palavras e outra de áudio que serão reproduzidos pelo programa na exposição de palavras coloridas com exposição de áudio.</li> <li>Imagem com áudio: Nesse tipo deve ser selecionado uma lista de imagens e outra de áudio que serão reproduzidos pelo programa. A exposição </li> </ul> </td> </tr> <tr> <td>Número de tentativas</td> <td>Define a quantidade de tentativas do úsuario. O número de tentativas equivale ao número de estimulos que serão mostrados.<br>Quando o número de itens nas listas é menor que o número de tentativas, será utilizada a quantidade de itens das listas repetindo os itens o necessário para atingir o número de tentativas. Da mesma forma, quando o número de itens nas listas é maior que o número de tentativas, será utilizada a quantidade de itens das listas correspondente ao número de tentativas. </td> </tr> <tr> <td> Ordem aleatória </td> <td> Indica se a exposição dos estímulos será feita de forma aleatória em relação a ordem da lista. </td> </tr> <tr> <td> Tamanho da palavra </td> <td> Indica o tamanho da fonte do texto, para exposição do tipo "Palavra", "Palavra com áudio" ou "Imagem e palavra". O tamanho padrão é 160. </td> </tr> <tr> <td> Cor da palavra </td> <td> Indica a cor da palavra, para exposição do tipo "Palavra e Imagem" ou "Imagem e Palavra". A cor padrão é preta. </td> </tr> <tr> <td> Expandir imagem </td> <td> Define a expansão da imagem no limite proporcional à tela. Não podeocorrer simultaneamente à apresentação de legenda. </td> </tr> <tr> <td> Girar Imagem </td> <td> Define a rotação da imagem no ângulo e sentido indicados na lista. </td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Listas </th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td> Palavras </td> <td> Carrega a lista de palavras que serão apresentadas para os tipos "Palavra" e "Palavra com Áudio". A exposição não aleatória seguirá a ordem das palavras na lista. </td> </tr> <tr> <td>Cores</td> <td>Carrega a lista de cores das palavras que serão apresentadas para os tipos "Palavra" e "Palavra com Áudio". A exposição não aleatória seguirá a ordem das cores na lista.</td> </tr> <tr> <td>Imagens</td> <td>Carrega a lista de imagens que serão apresentadas para os tipos "Imagem", "Imagem com Áudio" e "Imagem e Palavra". A exposição não aleatória seguirá a ordem das imagens na lista.</td> </tr> <tr> <td>Áudios</td> <td>Carrega a lista de áudios que serão reproduzidos no teste para os tipos "Palavra com Áudio" e "Imagem com Áudio". A exposição não aleatória seguirá a ordem dos áudios na lista.</td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Tempo </th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td> Exposição(ms) </td> <td> Define a duração em milissegundos da exposição do estímulo escolhido, palavra ou imagem. </td> </tr> <tr> <td>Intervalo(ms)</td> <td>Define o tempo em milissegundos entre as tentativas.</td> </tr> <tr> <td>Tempo Intervalo Variável </td> <td>Indica que o intervalo terá a duração variada aleatoriamente a partir de 400ms até o tempo de intervalo informado.</td> </tr> <tr> <td>Atraso </td> <td> Define o tempo em milissegundos entre os estímulos pareados para os tipos "palavra", "imagem" ou "imagem e palavra". Se não informado, será usado o tempo de intervalo.</td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Legenda </th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Ativar</td> <td>Indica se a exposição imagem terá legenda. Ao ativar, deve ser selecionada alista de palavras a serem apresentadas como legenda.</td> </tr> <tr> <td>Cor</td> <td>Indica a cor da legenda. Será utilizada a cor preta, se não informado</td> </tr> <tr> <td>Posição</td> <td> Indica o local que será colocada a legenda em relação ao estímulo: ←, àesquerda (imagens); ↑, acima (palavras e imagens); →, à direita(imagens); ↓, abaixo (palavras e imagens); ・, ao centro (imagens); Aleatória, variar aposição, de acordo com o tipo do estímulo</td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Ponto de fixação </th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Tipo</td> <td>Indica a forma do ponto de fixação: + ou ・</td> </tr> <tr> <td>Cor do ponto</td> <td>Indica a cor do ponto de fixação.</td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Outros </th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Capturar Áudio durante Execução </td> <td>Indica que as respostas do usuário serão gravadas automaticamente durante a execução.Será gerado um arquivo de áudio na pasta de dados. Exige o arquivo NAudio.dll esteja na mesma pasta do teste. O padrão é selecionado.</td> </tr> <tr> <td>Cor de Fundo </td> <td>Define a cor tela por trás do estímulo durante a apresentação. O padrão é tela cinza.</td> </tr> <tr> <td>Instruções </td> <td>Descreve as orientações para o participante sobre a execução do teste. Cada linha informada será apresentada em uma tela durante 4 segundos.</td> </tr> </table> </body> </html>

# showDataInstructions
source: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">General</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Option</th> <th class = "subBar">Description</th> </tr> <tr> <td>Export as .cvs</td> <td>It exports the results to a file with values separated by comma, which can be opened by spreadsheet editors programs (ex: libre office).</td> </tr> <tr> <tr> <td>Play audio</td> <td>Option to transmit the recorded audio during the test run, if the program used had this option.</td> </tr> <th class = "mainBar" colspan = "2">Results</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Option</th> <th class = "subBar">Description</th> </tr> <tr> <td>Program</td> <td>Indicates the name of the program that was running at the time of the stimulus.</td> </tr> <tr> <td>Participant</td> <td>Shows the user name</td> </tr> <tr> <td>Date</td> <td>Indicates the that date the program was run</td> </tr> <tr> <td>Starting time</td> <td>Indicates the exact moment the user started the test</td> </tr> <tr> <td>Exposition(ms)</td> <td>Indicates how long the exposure has appeared (if user responds the total exposure time is equivalent to the reaction time)</td> </tr> <tr> <td>Sequence</td> <td>Indicates the chronological order in which the stimulu appeared for the user</td> </tr> <tr> <td>Stimulus type</td> <td>Indicates which type of stimulus was shown to the user</td> </tr> <tr> <td>Subtitle</td> <td>Indicates the caption displayed to the user</td> </tr> <tr> <td>Subtitle position</td> <td>Indicates in which position the caption was displayed</td> </tr> <tr> <td>Stimulus</td> <td>Indicates the name of the stimulus that was displayed to the user</td> </tr> <tr> <td>Stimulus color</td> <td>Indicates the color that the stimulus appeared to the user</td> </tr> <tr> <td>Audio</td> <td>Information if there was audio capture during the stimulus</td> </tr> </table> </body> </html>
pt_br: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Geral</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Exportar como .cvs</td> <td>Exporta os resultados para um arquivo com valores separados por vigula, que podem ser abertis por programas editores de planilhas (ex: libre office).</td> </tr> <tr> <td>Reproduzir áudio</td> <td>Opção para transmitir o áudio gravado durante a execução do teste, se o programa utilizado tinha esta opção.</td> </tr> <th class = "mainBar" colspan = "2">Resultados</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>programa</td> <td>Indica o nome do programa que estava sendo executado no momento do estimulo.</td> </tr> <tr> <td>Participante</td> <td>Indica o nome do participante</td> </tr> <tr> <td>Data</td> <td>Indica a data em que o programa foi executado</td> </tr> <tr> <td>Horario</td> <td>Indica o exato momento em que o usuário iniciou o teste</td> </tr> <tr> <td>Tempo(ms)</td> <td>Indica o exato momento em que a exposição ocorreu</td> </tr> <tr> <td>Sequência</td> <td>Indica a ordem cronológica em que os estímulos apareceram para o usuário</td> </tr> <tr> <td>Tipo estimulo</td> <td>Indica qual tipo de estimulo foi exibido ao usuário</td> </tr> <tr> <td>Legenda</td> <td>Indica qual foi a legenda exibida ao usuário</td> </tr> <tr> <td>Posição legenda</td> <td>Indica em qual posição a legenda foi exibida</td> </tr> <tr> <td>Estimulo</td> <td>Indica o nome do estimulo que foi exibido ao usuário</td> </tr> <tr> <td>Cor</td> <td>Indica a cor que o estimulo apareceu ao usuário</td> </tr> <tr> <td>Audio</td> <td>Informação se houve captura de áudio durante o estimulo</td> </tr> </table> </body> </html>
