Repository: lab-neuro-comp/Test-Platform
Catalog: StroopTest/Resources/Localizations/LocalizedResources.*.resx
Languages: es_es, pt_br

# MatchConfigInstructions
source: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <th class = "mainBar" colspan = "2">General</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Options</th> <th class = "subBar">Description</th> </tr> <tr> <td>Program name</td> <td>Should be the name of the program that will be created. Program names should only have alphanumeric characters and have no spaces. This name will be the same name that must be selected when selecting a program to be executed and in the export/import</td> </tr> <td colspan = "2" style = "background: #fff"> </td> <tr> <th class = "mainBar" colspan = "2">Exposition</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Options</th> <th class = "subBar">Description</th> </tr> <tr> <tr> <td>Exposition type</td> <td> The matching test working this way: will be exposed a model and some stimulus for the participant choose, The model will aways appears as stimulu.<br> The way that the participant will react to the stimulus will depends of exposition type, that are:<br> <ul> <li>DMTS: The participant must choose the stimulus that is equal to the model shown.</li> <li>DNMTS: The participant must NOT choose the estimate that is equal to the model shown.</li> <li>DMTS/DNMTS: The participant will be exposed, alternately, to DMTS and DNMTS, making the appropriate choice for the type of exhibition that will be displayed.</li> </ul> </td> </tr> <tr> <td>Stimulu type</td> <td>Stimulus Type sets the type of stimulus to be displayed, the alternatives being:<br> <ul> <li>Image: It should be chosen a list of images that will be shown as stimulus</li> <li>Word: A list of words and a fixed color must be chosen for them to be displayed</li> <li>Word and Color: Two lists should be chosen, one being a word and one color, so that each word appears with a color from the list</li> </ul> Comments:<br> <ul> <li>The number of elements in the list of words or images must always be greater than the number of stimuli.</li> <li>The number of elements in the list should preferably be greater than the total number of stimuli that will be shown.</li> </ul> </td> </tr> <tr> <td>Stimulus number</td> <td>Defines how many stimuli will appear after the model so that the participant chooses one of them.</td> </tr> <tr> <td>Attempts number</td> <td> Sets the number of retries the user will have.</td> </tr> <tr> <td>Exposition size</td> <td>Defines the size of the stimulus and its meaning varies for each type of main stimulus:<br> <ul> <li>For image list: The size of the stimulus defines, in pixels, the size of the square that the image will be displayed.</li> <li>For list of words: The size of the stimulus defines, in pixels, the font size that the word will be rendered.</li> </ul> </td> </tr> <tr> <td>Random position</td> <td>Sets whether to use preset positions or random positions.<br> <ul> <li>Stimuli: The stimuli will appear in random positions, but they will never overlap.</li> <li>Model: The model will appear in a random position.</li> </ul> </td> </tr> <tr> <td>Random order</td> <td>Defines whether the order of appearance of exposures will follow the order in the list or whether they will be reordered at the beginning of each program run.</td> </tr> <tr> <td>Finish model exposition with click</td> <td>Sets whether the model will disappear if the participant clicks it.</td> </tr> <tr> <th class = "mainBar" colspan = "2">Lists</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Options</th> <th class = "subBar">Description</th> </tr> <tr> <td>Words</td> <td>Defines the list of words that will be used in the exposition of words or words and colors.</td> </tr> <tr> <td>Colors</td> <td>Sets the color list that will be used in the exposition of words and colors.</td> </tr> <tr> <td>Images</td> <td> Sets the list of images that will be used in the image exposition.</td> </tr> <tr> <td>Audios</td> <td>There is still no use for this type of list in the test of choice.</td> </tr> <tr> <th class = "mainBar" colspan = "2">Time</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Options</th> <th class = "subBar">Description</th> </tr> <tr> <td>Model exposition(ms)</td> <td>Sets, in ms, the time the model will be exposed.</td> </tr> <tr> <td>Stimulu exposition(ms)</td> <td>Sets, in ms, the time the stimuli will be exposed.</td> </tr> <tr> <td>Delay between model and stimulus(ms)</td> <td>Sets, in ms, the interval time between the model and the stimuli.</td> </tr> <tr> <td>Delay between attempts(ms)</td> <td>Sets, in ms, the interval time between the stimuli and the model of the next exposure.</td> </tr> <tr> <td>Atraso entre modelo e estimulo variável</td> <td>Sets whether the interval between attempts is random.<br> <ul> <li>If this option is checked, the delay will be random, but never greater than the delay between attempts.</li> <li>The delay between attempts should be greater than or equal to 400ms.</li> </td> </tr> <tr> <td>Variable delay between model and stimuli</td> <td>Sets whether the interval between the model and the stimuli is random.<br> <ul> <li>If this option is checked, the delay will be random, but never greater than the delay between the model and the stimuli.</li> <li>The delay between model and stimuli should be greater than or equal to 400ms.</li> </td> </tr> <tr> <th class = "mainBar" colspan = "2">Colors</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Options</th> <th class = "subBar">Description</th> </tr> <tr> <td>DMTS Background </td> <td> Defines DMTS expostion background <li>If the type of exposure is DMTS / DNMTS what will indicate the current exposure type is the background color.</li> </td> </tr> <tr> <td>DNMTS Background </td> <td>Defines DNMTS expostion background <li>If the type of exposure is DMTS / DNMTS what will indicate the current exposure type is the background color.</li> </td> </tr> <tr> <td>Words</td> <td>Words In the 'words' expostion type, this will be the color in which all the words in the list will be rendered.</td> </tr> <tr> <th class = "mainBar" colspan = "2">Auditory signaling</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Options</th> <th class = "subBar">Description</th> </tr> <tr> <td>Exposition</td> <td>Sets if will be an auditory signaling when an exposition is shown</td> </tr> <tr> <td>Match / Error</td> <td>Sets if will be an auditory signaling when the participant match of do not match the chosen stimulu with the model.</td> </tr> <tr> <td>Commission</td> <td>Sets if will be an error auditory signaling when user click on model with the option 'End model exposition with click' disabled. </td> </tr> <tr> <td>Omission</td> <td>Sets if will be an error auditory signaling when the participant do not click on model or the stimulu in time.</td> </tr> <tr> <th class = "mainBar" colspan = "2">Instructions</th> </tr> <tr> <td colspan = "2">Defines the text that will be displyed at start of the program, each line in this text will be rendered in a blank screen at exposition.</td> </tr> </table> </body> </html>
pt_br: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <th class = "mainBar" colspan = "2">Geral</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Nome do programa</td> <td>Deve ser preenchido com o nome do programa que será criado. O nome deve conter apenas caracteres alfanuméricos e não deve possuir espaço. Esse mesmo nome será utilizado na hora de escolher o programa que será execultado, na página de resultados e importação/exportação</td> </tr> <td colspan = "2" style = "background: #fff"> </td> <tr> <th class = "mainBar" colspan = "2">Exposição</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <tr> <td>Tipo de exposição</td> <td> O teste de escolha funciona do seguinte modo: Será exibido um modelo, e logo em seguida diversos estimulos, o modelo sempre aparecerá como estimulo.<br> O modo em que o participante deverá reagir ao estimulo depende do tipo de exposição, são eles:<br> <ul> <li>DMTS: O participante deve escolher o estimulo que seja igual ao modelo mostrado.</li> <li>DNMTS: O participante NÃO deve escolher o estimlo que seja igual ao modelo mostrado.</li> <li>DMTS/DNMTS: O participante será exposto, alternadamente, ao DMTS e ao DNMTS, devendo realizar a escolha adequada ao tipo de exposição que será exibido.</li> </ul> </td> </tr> <tr> <td>Tipo de estimulo</td> <td>Define o tipo de estimulo que será exibido, sendo as alternativas:<br> <ul> <li>Imagem: Deverá ser escolhida uma lista de imagens que serão mostrados como estimulo</li> <li>Palavra: Deverá ser escolhida uma lista de palavras e uma cor fixa para que elas sejam exibidas</li> <li>Palavra e Cor: Deverá ser escolhida duas listas, sendo elas uma de palavra e uma de cores para que cada palavra apareça com uma cor da lista</li> </ul> Observações:<br> <ul> <li>O número de elementos da lista de palavras ou de imagens deverá ser sempre maior do que o número de estimulos.</li> <li>O número de elementos da lista deve ser, preferencialmente, maior do que o numero total de estimulos que será mostrado.</li> </ul> </td> </tr> <tr> <td>Número de estimulos</td> <td>Define quantos estimulos aparecerão após o modelo para que o participante escolha um deles.</td> </tr> <tr> <td>Número de tentativas</td> <td>Define o número de tentativas que o usuário terá.</td> </tr> <tr> <td>Tamanho da exposição</td> <td>Define o tamanho de estimulo e seu significado varia para cada tipo de estimulo principal:<br> <ul> <li>Para lista de imagens: O tamanho do estimulo define, em pixels, o tamanho do quadrado que exibirá a imagem.</li> <li>Para lista de palavras: O tamanho do estimulo define, em pixels, o tamanho da fonte que a palavra será renderizada. </li> </ul> </td> </tr> <tr> <td>Posição aleatória</td> <td>Define se serão utilizadas as posições pre-definidas ou posições aleatórias.<br> <ul> <li>Estimulos: Os estimulos aparecerão em posições aleatórias, porém nunca irão se sobrepor.</li> <li>Modelo: O modelo aparecerá em uma posição aleatória.</li> </ul> </td> </tr> <tr> <td>Ordem aleatória</td> <td>Define se a ordem de aparição das exposições seguirá a ordem a lista ou se eles serão reordenados no inicio de cada execução do programa.</td> </tr> <tr> <td>Finalizar esposição do modelo com clique</td> <td>Define se o modelo desaparecerá caso o participante clique nele.</td> </tr> <tr> <th class = "mainBar" colspan = "2">Listas</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Palavras</td> <td>Define a lista de palavras que será utilizada na exposição de palavras ou palavras e cores.</td> </tr> <tr> <td>Cores</td> <td>Define a lista de cores que será utilizada na exposição de palavras e cores.</td> </tr> <tr> <td>Imagens</td> <td>Define a lista de imagens que será utilizada na exposição de imagens.</td> </tr> <tr> <td>Áudios</td> <td>Ainda não há uso para esse tipo de lista no teste de escolha.</td> </tr> <tr> <th class = "mainBar" colspan = "2">Tempo</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Exposição do modelo(ms)</td> <td>Define, em ms, o tempo em que o modelo ficará exposto.</td> </tr> <tr> <td>Exposição dos estimulos(ms)</td> <td>Define, em ms, o tempo em que os estimulos ficarão expostos.</td> </tr> <tr> <td>Atraso entre modelo e estimulo(ms)</td> <td>Define, em ms, o tempo de intervalo entre o modelo e os estimulos.</td> </tr> <tr> <td>Atraso entre tentativas(ms)</td> <td>Define, em ms, o tempo de intervalo entre os estimulos e o modelo da próxima exposição.</td> </tr> <tr> <td>Atraso entre modelo e estimulo variável</td> <td>Define se o intervalo entre o modelo e os estimulos será aleatório.<br> <ul> <li>Caso essa opção esteja marcada, o atraso será aleatório, porém nunca maior do que o atraso entre o modelo e os estimulos.</li> <li>O atraso entre modelo e estimulos deve ser maior ou igual 400ms.</li> </td> </tr> <tr> <td>Atraso entre tentativas variável</td> <td>Define se o intervalo entre as tentativas será aleatório.<br> <ul> <li>Caso essa opção esteja marcada, o atraso será aleatório, porém nunca maior do que o atraso entre tentativas.</li> <li>O atraso entre tentativas deve ser maior ou igual 400ms.</li> </td> </tr> <tr> <th class = "mainBar" colspan = "2">Cores</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Fundo do DMTS</td> <td>Define o fundo da exposição DMTS <li>Caso o tipo de exposição seja DMTS/DNMTS o que indicará o tipo de exposição atual é a cor de fundo.</li> </td> </tr> <tr> <td>Fundo do DNMTS</td> <td>Define o fundo da exposição DNMTS <li>Caso o tipo de exposição seja DMTS/DNMTS o que indicará o tipo de exposição atual é a cor de fundo.</li> </td> </tr> <tr> <td>Palavras</td> <td>No tipo de exposição 'palavras', essa será a cor em que todas as palavras da lista serão renderizadas.</td> </tr> <tr> <th class = "mainBar" colspan = "2">Sinalização auditiva</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Exposição</td> <td>Define se haverá sinalização auditiva indicando quando um estimulo ou modelo é renderizado</td> </tr> <tr> <td>Acerto / Erro</td> <td>Define se haverá sinalização auditiva indicando quando o usuário aceta ou erra a escolha do estimulo de acordo com o tipo de exposição.</td> </tr> <tr> <td>Comissão</td> <td>Define se haverá sinalização auditiva de erro quando o usuário clicar no modelo e a opção 'Finalizar exposição do modelo com clique' estiver desativada. </td> </tr> <tr> <td>Omissão</td> <td>Define se haverá sinalização auditiva de erro quando o usuário não realizar uma escolha de estimulo ou clicar no modelo no intervalo definido pelo tempo de exposição do modelo ou tempo de exposição do estimulo</td> </tr> <tr> <th class = "mainBar" colspan = "2">Instrução</th> </tr> <tr> <td colspan = "2">Define o texto que será exibido no inicio do teste. Cada linha desse campo aparecerá separadamente na execução do programa.</td> </tr> </table> </body> </html>

# posNumberNotImplemented
source: Position number currently not implemented.
pt_br: Número de posições ainda não disponível.

# dispositionError
source: A-B disposition must be selected.
pt_br: Disposição A-B deve ser selecionada.

# audioListError
source: choose an audio list
pt_br: Selecione uma lista de audios

# colorListError
source: choose a color list
pt_br: Selecione uma lista de cores

# imgListError
source: choose a image list
pt_br: Selecione uma lista de imagens

# matchingTestHeader
source: Program\t#\tParticipant\tDate\tInitial Time\tExposition Time\tModel Reaction Time(ms)\tStimulu Reaction Time(ms)\tInterval between attempts(ms)\tInterval(ms)\tModel Exposition(ms)\tStimulu Exposition(ms)\tSenquency\tTest Type\tStimulus Type\tList\tModel first position\tModel\tModel color\t2nd Stimulu\t3rd Stimulu\t4th Stimulu\t5th Stumulu\t6th Stimulu\t7th Stimulu\t8th Stimulu\tModel second position\tClicked Stimulu\tClicked Stimulu Color\tClicked Stimulu Position\tMatch
pt_br: Programa\t#\tParticipante\tData\tHorario Inicial\tTempo de Exposição\tReação do modelo(ms)\tReação do estimulo(ms)\tIntervalo das tentativas(ms)\tIntervalo(ms)\tExposição do modelo(ms)\tExposição do estímulo(ms)\tSenquencia\tTipo de Teste\tTipo de estimulo\tLista\tPrimeira posição do modelo\tModelo\tCor do modelo\tEstimulo 2\tEstimulo 3\tEstimulo 4\tEstimulo 5\tEstimulo 6\tEstimulo 7\tEstimulo 8\tSegunda posição do modelo\tNome do estimulo clicado\tCor do estimulo clicado\tPosição do estimulo clicado\tIgual

# CannotBeEmpty
source: This field should be filled
pt_br: Esse campo deve ser preenchido

source: Matching Test
pt_br: Teste de escolha

source: Model
pt_br: Modelo

source: Stimulu
pt_br: Estimulo

source: Image and Word
pt_br: Imagem e Palavra

source: Image with Audio
pt_br: Imagem com Aúdio

source: Shape
pt_br: Forma

source: Word
pt_br: Palavra

source: Word with Audio
pt_br: Palavra com Aúdio

# recoverList
source: Are you sure that you want to recover all the selected lists?
pt_br: Você tem certeza que deseja recuperar todas as listas selecionadas?

# listsNotRecovered
source: No list was recovered.
pt_br: Nenhuma lista foi recuperada.

# listsRecovered
source: All selected lists were recovered sucessful!
pt_br: Todas as listas selecionadas foram recuperadas com sucesso!

# impossibleUseListWarn
source: The list is smaller than the number of stimulus. Reduce the number of stimulus or choose a larger list
es_es: La lista es menor que el número de estímulos. Reducir el número de estímulos o elegir una lista más grande
pt_br: A lista é menor que o número de estimulos. Diminua o numero de estimulos ou escolha uma lista maior

# smallImageList
source: The list has less elements than the necessary, image repetition may occur
es_es: La lista es menor que lo necesario. Repeticiones de imágenes pode ocorrer
pt_br: A lista é menor do que o necessário para não haver repetições

# wordListError
source: choose a word list
pt_br: escolha uma lista de palavras.

# cantBeFoundPleaseRocoverFirst
source: is a program of the experiment that doesn't exists in your programs folder. Please recover it first or create a new program with same name. (Experiment:
es_es: es un programa del experimento que no existe en la carpeta de programas. Recupere primero o cree un nuevo programa con el mismo nombre. (Experimento:
pt_br: é um programa do experimento que não existe na pasta de seus programas. Recupere-o primeiro ou crie um novo programa com o mesmo nome. (Experimento:

# cannotRecoverFilesByMotive
source: You should create or recover the following lists before recovering the program "
es_es: Debe crear o recuperar las siguientes listas antes de recuperar el programa "
pt_br: Você deve criar ou recuperar as seguintes listas antes de recuperar o programa "

source: Error:
pt_br: Erro:

# hasMissingLists
source: has lists that was incorretly deleted: "
pt_br: possui listas que foram excluídas incorretamente: "

# missingListSolution
source: . You must create a list manually or delete the program. Want to delete the program?
pt_br: . Você deve criar a lista manualmente ou excluir o programa. Deseja excluir o programa?

# wanstPossibleToRecoverLists
source: Coudn't display lists because the program
pt_br: Não foi possível exibir as listas pois o programa

# cantEdìtProgramMissingFiles
source: Wasn't possible to open program edition because there is missing files. Recover or create the following lists before continue:
pt_br: Não foi possível abrir a edição de programa pois está faltando arquivos. Recupere ou crie essas listas antes de continuar:

source: Word with Color
pt_br: Palavra com Cor
