Repository: lab-neuro-comp/Test-Platform
Catalog: StroopTest/Resources/Localizations/LocalizedResources.*.resx
Languages: es_es, pt_br

# wordColorConfigInstructions
source: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">General</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Option</th> <th class = "subBar">Description</th> </tr> <tr> <td>Name</td> <td>Indicates the name of the list. The list name must contain only alphanumeric characters and must have no spaces.</td> </tr> <tr> <th class = "mainBar" colspan = "2">List Options</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Option</th> <th class = "subBar">Description</th> </tr> <tr> <td>Word list</td> <td>When the word list box is checked, the created word list will be saved.</td> </tr> <tr> <td>Color list</td> <td>When the word list box is checked, the created color list is saved. If both boxes have been checked, both lists are saved.</td> </tr> <tr> <td>New Item</td> <td>Opens a screen to fill in a new word and its color. The default color is black.</td> </tr> <tr> <td>Delete Item</td> <td>Exclude from the list the word and its corresponding color selected with the "Delete" button.</td> </tr> <tr> <td>Move Item</td> <td>Repositions the selected color word in the list with the "Up" and "Down" buttons.</td> </tr> </table> </body> </html>
pt_br: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Geral</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Nome</td> <td>Indica o nome da lista. O nome da lista deve conter apenas caracteres alfanumericos e não deve possuir espaços.</td> </tr> <tr> <th class = "mainBar" colspan = "2">Opções da lista</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Lista de Palavras</td> <td>Quando a caixa da lista de palavras estiver marcada, será salva a lista de palavras criada</td> </tr> <tr> <td>Lista de Cores</td> <td>Quando a caixa da lista de palavras estiver marcada, será salva a lista de cores criada. Se ambas as caixas estiveram marcadas, ambas listas serão salvas.</td> </tr> <tr> <td>Novo Item</td> <td>Abre uma tela para preencher uma nova palavra e sua cor. A cor padrão é preto.</td> </tr> <tr> <td>Apagar Item</td> <td>Exclui da lista a palavra e sua cor correspondente selecionada com o botão “Apagar”.</td> </tr> <tr> <td>Mover Item</td> <td>Reposiciona a palavra colorida selecionado na lista com os botões “Acima” e “Abaixo”.</td> </tr> </table> </body> </html>

# backgroundColorError
source: Background color of the program should be 'false' or a color hexadecimal code
pt_br: Cor de Fundo do programa deve ser 'false' ou um código hexadecimal de cor

# defaultReactionInstructions1
source: Random squares will be displayed. Press the space bar when you see the square.
pt_br: Serão apresentados quadrados de forma aleatória. Aperte a barra de espaço quando ver o quadrado.

# defaultReactionInstructions2
source: The task will start now
pt_br: A tarefa vai começar agora

# defaultReactionProgram
source: default 12 1000 50 2000 false false #000000 False 0 #FFFF00 shapes false false + #FF0000 True square, False 4 space false false 10 false false
pt_br: padrao 12 1000 50 2000 false false #000000 False 0 #FFFF00 shapes false false + #FF0000 True square, False 4 space false false 10 false false

# defaultReactionProgramError
source: Couldn't write default Reaction Test program.
pt_br: Erro ao criar o programa padrão do teste de tempo de reação.

# defaultStroopInstruction1
source: This test will present colored words in random order. Words will appear and rapidly disappear
pt_br: Serão apresentadas palavras coloridas de forma aleatória. Palavras surgirão rapidamente e em seguida desaparecerão

# defaultStroopInstruction2
source: Say out loud the color that the word is painted
pt_br: Diga a cor em que a palavra está escrita

# defaultStroopInstruction3
source: This task will start now
pt_br: A tarefa vai começar agora

# defaultWordList
source: yellow blue green red
pt_br: amarelo azul verde vermelho

# expositionTypeError
source: Exposition type must be one of the following
pt_br: Tipo de exposição deve ser um dos seguintes

source: File name
pt_br: Nome do arquivo

# fileNameError
source: of list must finish with .lst
pt_br: de lista deve ter terminação .lst

# fileNameError1
source: Program name in file must be equal to file name.
pt_br: Nome do programa contido dentro do arquivo deve ser igual ao nome do arquivo.

# fixPointColorError
source: Color of the fixation point should be 'false' or a color hexadecimal code
pt_br: Cor do ponto de fixação deve ser 'false' ou um código hexadecimal de cor

# fixPointError
source: The point of fixation of the program must be represented by: \ n '+' - cross-sectional point \ n'o '- fixing point circle \ n'false' - if there is no point;
pt_br: O ponto de fixação do programa deve ser representado por:\n'+' - ponto de fixação cruz\n'o' - ponto de fixação circulo\n'false' - se não houver ponto;

# notCreated
source: wasn't written\n\n
pt_br: não foi escrito\n\n

# reactionTestHeader
source: program\t#\tparticipant\tdate\tInitial Time\tExposition time\tReactionTime(ms)\tInterval(ms)\tEstimated Interval(ms)\tExposition Duration(ms)\tExposition(ms)\tsenquency\tpos\tUser response\tList1\tStimulus1\tList2\tStimulus2 Type\tstimulus\tStimulus Color\tBeep
pt_br: Programa\t#\tParticipante\tData\tHorário inicial\tHorário exposição\tTR(ms)\tIntervalo(ms)\tIntervalo estimado(ms)\tExposição tempo(ms)\tExposicao(ms)\tSequência\tPosição\tResposta usuário\tTipo estímulo\tLista1\tEstímulo1\tLista2\tEstímulo2\tCor do estímulo\tBeep

# responseTypeError
source: Selected response type is invalid. Valid options are: spacebar or key arrows.
pt_br: Tipo de resposta selecionado inválido. As opções válidas são: barra de espaço ou setas.

# stroopResultHeader
source: program\t#\tparticipant\tdate\thour\ttime(ms)\tsequency\tStimulus type\tSubtitle\tSubtitle position\tstimulus\tcolor\taudio
pt_br: programa\t#\tParticipante\tdata\thorario\ttempo(ms)\tsequencia\ttipo estimulo\tlegenda\tposicao legenda\testimulo\tcor\taudio

# subtitleColorError
source: Subtitle color must be 'false' or a hex color code
pt_br: Cor da Legenda deve ser 'false' ou um código hexadecimal de cor

# subtitlePositionError
source: Subtitle position
pt_br: Posição da legenda

# subtitlePositionError1
source: must be a number between 1 and 5.
pt_br: deve ser um número de 1 a 5

# wordColorError
source: Word point color must be 'false' or a hexadecimal color code
pt_br: Cor do ponto da palavra deve ser 'false' ou um código hexadecimal de cor

source: open
pt_br: abrir

# listError
source: Choose a list
pt_br: Selecione uma lista

# defaultStroopProgram
source: default 16 1000 true 1000 False default_words.lst default_color.lst false true false 1 false txt false false 160 false false false false 0 0 false false
pt_br: padrao 16 1000 true 1000 False padrao_words.lst padrao_color.lst false true false 1 false txt false false 160 false false false false 0 0 false false

source: arrowDown
pt_br: setaBaixo

source: arrowLeft
pt_br: setaEsquerda

source: arrowRight
pt_br: setaDireita

source: arrowUp
pt_br: setaCima

source: spaceBar
pt_br: barraDeEspaço

source: Delete program:
pt_br: Excluir programa:

# programDeleted
source: was deleted sucessful!
pt_br: foi excluído com sucesso!

# programExistsInBackup
source: A program with this name already exists in backup folder. \n Do you want to overwrite it?
pt_br: O programa já existe na pasta de backup, deseja sobrescrevê-lo?

# programNotDeleted
source: The program will not be deleted!
pt_br: O programa não será excluído!

# recoveredSucessful
source: All selected programs were recovered successful.
pt_br: Todos os programas selecionados foram recuperados com sucesso.

# programRecovered
source: was recovered sucessful!
pt_br: foi recuperado com sucesso!

# programNotRecovered
source: The program will not be recovered!
pt_br: O programa não será recuperado!

# conflictsFound
source: conflict(s) found. Do you want to treat them now?
pt_br: conflito(s) encontrado(s). deseja trata-lo(s) agora?

source: Conflict
pt_br: Conflito

source: delete
pt_br: excluir

source: Deleted experiments:
pt_br: Experimentos excluídos:

# deletedPrograms
source: Deleted files:
pt_br: Arquivos excluídos:

source: Existing experiments:
pt_br: Experimentos existentes:

# existingPrograms
source: Existing files:
pt_br: Arquivos existentes:

source: recover
pt_br: recuperar

# toDeleteExperiments
source: Experiments that will be deleted:
pt_br: Experimentos que serão excluídos:

# toDeletePrograms
source: Files that will be deleted:
pt_br: Arquivos que serão excluídos:

# toRecoverExperiments
source: Experiments that will be recovered:
pt_br: Experimentos que serão restaurados:

# toRecoverPrograms
source: Files that will be recovered:
pt_br: Arquivos que serão restaurados:

# warningDelete
source: Warning: Items marked in red indicate that there's existing files with same name in backup folder. Deleting these files will overwrite the existing ones, and you will not be able to recover them.
pt_br: Aviso: Itens marcados em vermelho indicam arquivos com o mesmo nome já existentes. Excluir esses arquivos irá sobreescrever os já existentes, não sendo possível recupera-los.

# warningRecover
source: Warning: Items marked in red indicate that there's existing files with same name. Recovering these files will overwrite the existing ones, and you will not be able to recover them.
pt_br: Aviso: Itens marcados em vermelho indicam arquivos com o mesmo nome já existentes. Recuperar esses arquivos irá sobreescrever os já existentes, não sendo possível recupera-los.

# deletedSucessful
source: All selected programs were deleted successful.
pt_br: Todos os programas selecionados foram deletedos com sucesso.

# expoTypeError
source: Exposition type must be selected.
pt_br: O tipo de exposição deve ser selecionado.

# savePending
source: There might have unsaved changes in the program. Do you wish to save them?
pt_br: Pode haver mudanças não-salvas no programa que está sendo editado. deseja grava-las?

# savePendingTitle
source: Unsaved changes
pt_br: Alterações não-salvas

# unsavedLists
source: There might have unsaved changes in the list. Do you wish to save them?
pt_br: Pode haver mudanças não-salvas na lista que está sendo editada. deseja grava-las?

# unsavedListsTitle
source: Unsaved lists
pt_br: Listas não-salvas

# exportSuccess
source: Files were exported with success!
pt_br: Arquivos exportados com sucesso

# experimentConfigInstructions
source: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <th class = "mainBar" colspan = "2">General</th> </tr> <tr> <th class = "subBar" style = "width: 30%">Option</th> <th class = "subBar">Description</th> </tr> <tr> <td>Experiment name</td> <td>It should be made with the name of the experiment that will be created. The name must contain only alphanumeric characters and should not contain any space. This same name is used when choosing the experiment that is run on the results page and import / export</td> </tr> <td colspan = "2" style = "background: #fff"> </td> <tr> <th class = "mainBar" colspan = "2">Exposition</th> </tr> <tr> <th class = "subBar" style = "width: 30%">Option</th> <th class = "subBar">Description</th> </tr> <tr> <td> Random order </td> <td> Indicates whether the exposure of the programs will be made at random in relation to the order that the user added. If the option is selected the user can select a Training. </td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Time</th> </tr> <tr> <th class = "subBar" style = "width: 30%">Option</th> <th class = "subBar">Description</th> </tr> <tr> <td>Interval(ms)</td> <td>Indicates the interval between one program and another during the experiment</td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Program </th> </tr> <tr> <th class = "subBar" style = "width: 30%">Option</th> <th class = "subBar">Description</th> </tr> <tr> <td>Add</td> <td>Adds a program to the list of experiment programs.</td> </tr> <tr> <td>Training</td> <td>In random order the training program will always be the first test to be performed.</td> </tr> <tr> <td>Delete</td> <td>Removes the selected program program from the program list of the experiment.</td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Others</th> </tr> <tr> <th class = "subBar" style = "width: 30%">Option</th> <th class = "subBar">Description</th> </tr> <tr> <td>Instructions</td> <td>Describes the guidelines for the participant on the test run. Each displayed line will be displayed on a screen for 4 seconds.</td> </tr> </table> </body> </html>
pt_br: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <th class = "mainBar" colspan = "2">Geral</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Nome do experimento</td> <td>Deve ser preenchido com o nome do experimento que será criado. O nome deve conter apenas caracteres alfanuméricos e não deve possuir espaço. Esse mesmo nome será utilizado na hora de escolher o experimento que será execultado, na página de resultados e importação/exportação</td> </tr> <td colspan = "2" style = "background: #fff"> </td> <tr> <th class = "mainBar" colspan = "2">Exposição</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td> Ordem aleatória </td> <td> Indica se a exposição dos programas será feita de forma aleatória em relação a ordem que o usuário adicionou. Caso a opção esteja selecionada o usuário pode selecionar um Treino. </td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Tempo </th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Intervalo(ms)</td> <td>Indica o intervalo entre um programa e outro durante o experimento</td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Programas </th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Adicionar</td> <td>Adiciona um programa à lista de programas do experimento.</td> </tr> <tr> <td>Treino</td> <td>Na ordem aleatória o programa de treino sempre será o primeiro teste que será realizado.</td> </tr> <tr> <td>Apagar</td> <td>Remove o programa selecionado programa da lista de programas do experimento.</td> </tr> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Outros </th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Instruções </td> <td>Descreve as orientações para o participante sobre a execução do teste. Cada linha informada será apresentada em uma tela durante 4 segundos.</td> </tr> </table> </body> </html>

# fileManagmentConfigInstructions
source: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <th class = "mainBar" colspan = "2">General</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Option</th> <th class = "subBar">Description</th> </tr> <tr> <td>Existing files / Deleted files</td> <td>This list indicates the files that exist and <u>can be deleted</u> or the files that have been deleted and <u>can be recovered</u></td> </tr> <tr> <td>Files to be restored / deleted</td> <td>This list indicates which files exist and <u> will be deleted </u> or deleted files <u>will be recovered </u></td> </tr> <tr> <td style = "color: red">Red files</td> <td>The files indicated in red by the list indicate that they already have a program or experiment with the same name in the source folder and restoring / deleting this file will result in the loss of the file with the same name in the destination folder</td> </tr> </table> </body> </html>
pt_br: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <th class = "mainBar" colspan = "2">Geral</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Arquivos existentes/Arquivos excluídos</td> <td>Essa lista indica os arquivos que existem e <u>podem</u> ser excluídos ou os arquivos que foram excluídos e <u>podem</u> ser recuperados</td> </tr> <tr> <td>Arquivos que serão restaurados/excluídos</td> <td>Essa lista indica os arquivos que existem e <u>serão</u> excluídos ou os arquivos que foram excluídos e <u>serão</u> recuperados</td> </tr> <tr> <td style = "color: red">Arquivos em vermelho</td> <td>Os arquivos indicados em vermelho pela lista indica que já possuí um programa ou experimento com o mesmo nome na pasta de origem e restaurar/excluir esse arquivo resultará na perca do arquivo com o mesmo nome existente na pasta de destino</td> </tr> </table> </body> </html>
