Repository: lab-neuro-comp/Test-Platform
Catalog: StroopTest/Resources/Localizations/LocalizedResources.*.resx
Languages: es_es, pt_br

# technicalInformation
source: <h1> Technical Information </h1> <p> </p> <p> After installation, it is recommended to only use the shortcut that is created on the desktop, not tampering with the libraries and files that are used by the platform. </p> <p> </p> All program, list, and experiment setup created are stored in text format files, which should not be accessed directly, only via application. Besides these files, audio libraries and file manipulation (.zip) and localization specific files are used (in the case of this version, files for english). </p> <p> </p> This application was developed using the C # language in the Visual Studio IDE platform, compatible with Windows Vista operating system or superior. </p> <p> </p> Use the link <a href="https://github.com/lab-neuro-comp/Test-Platform/releases">TestPlatform (Releases) </a>to download any possible updates, checking the versino available there and your current version in about page. </p> <p> </p> For installation, the executable file must be placed in an application-only folder where the operating folders will be organized after the first run of the test as described below: </p> <p> </p> - TestPlatform (user-created folder for application use only) - TestFiles (files generated by the application to run the test) </p> <p> </p> Files and folders inside TestFiles should not be accessed, running the risk of corrupting files and making them inaccessible to the program! </p> <p> </p> To upgrade, the new version installation file must be run in the same folder as the previous version had been installed.
pt_br: <h1> Informações Técnicas </h1> <p> </p> <p> Após instalação, recomenda-se apenas a utilização do atalho que é criado na área de trabalho, não mexendo nas bibliotecas e arquivos que são utilizados pela plataforma. </p> <p> Toda a configuração de programas, lista e experimento criadas são armazenadas em arquivos formato texto, que não devem ser acessados diretamente, apenas via aplição. Além desses arquivos, são utilizadas bibliotecas de aúdio e manipulação de arquivos (.zip) e arquivos especificos de localização (no caso dessa versão, arquivos para português brasileiro). </p> <p> Esta aplicação foi desenvolvida utilizando a linguagem C# na plataforma IDE Visual Studio, compatível com sistema operacional Windows Vista ou superior. </p> <p> Utilize o link <a href="https://github.com/lab-neuro-comp/Test-Platform/releases"> Repositório Github - TestPlatform (Releases) </a> para baixar arquivos de atualizações. </p> <p> Para instalação, o arquivo executável deve ser colocado em uma pasta exclusiva para aplicação onde serão organizadas as pastas de operação após a primeira execução do teste conforme descrito a seguir: </p> <p> - TestPlatform (pasta criada pelo usuário para uso exclusivo da aplicação) <br /> -- TestFiles (arquivos gerados pela aplicação para execução do teste) </p> <p> Os arquivos e pastas dentro de TestFiles não devem ser acessadas, correndo o risco de corromper arquivos e torná-los inacessíveis para o programa! </p> <p> Para atualização, deve ser executado o arquivo de instalação da nova versão na mesma pasta em que a versão anterior tinha sido instalada. </p>

# viewHelp
source: <h1>TestPlatform</h1> <div> <p>What is your question? </p> <ul> <li><a href="#how">How the platform works</a> <ul> <li><a href="#lists"> Lists </a></li> <li><a href="#programs"> Programs </a></li> <li><a href="#experiments"> Experiments </a></li> <li><a href="#exec"> Execution</a></li> <li><a href="#results"> Results </a></li> <li><a href="#import"> Import/export</a></li> </ul> </li> <li><a href="#stroop"> StroopTest</a></li> <li><a href="#reaction"> ReactionTest</a></li> <li><a href="#matching"> MatchingTest</a></li> <li><a href="#update"> Platform Updates</a></li> <li><a href="#recommend"> Recommendations</a></li> <li><a href="#contact">Want to get in touch?</a></li> </ul> </div> <div> <h3 id="how">How the platform works</h3> <p> This platform is used for definition, execution and result analysis of neuropsychological tests in pre defined paradigms. It works with units called lists, programs and experiments.</p> <p>L<strong>ists </strong>are defined stimuli used in testing, being image, colors, words or audios.</p> <p>P<strong>rograms </strong>are test protocols defined by researcher using the platform and it can be of the following kinds: StroopTest, ReactionTest or MatchingTest. Each one representing one different paradigm.</p> <p>E<strong>xperiments </strong>are program collections, so that they can be executed in sequencies.</p> <p>Each platform page has it own help button (on the upper left section), so that specific information can be given. The left side bar in main page shows navigable parts of the system.</p> <p>The flow below describes how a program can be created, executed and has its results obtained in the system:</p> <p> </p> <p><img src="https://github.com/lab-neuro-comp/Test-Platform/blob/master/StroopTest/Resources/help_images/procedureEN.png?raw=true" alt="Flow" width="521" height="403" /></p> <h4 id="lists">Lists</h4> <p>Created lists will be used in programs. One must choose list type and create or edit it, giving a name and content. For audio lists files used must be of type ".wav", if you wish, you can record those files on tab "Audios" in lists. Image files can be diverse (.png, .jpeg, .bpm, and others). Color lists use hexadecimal naming.</p> <img src="https://github.com/lab-neuro-comp/Test-Platform/blob/master/StroopTest/Resources/help_images/listsEN.png?raw=true" alt="ListsMenu"/> <h4 id="programs">Programs</h4> <p>The programs are test configurations and can be created in the following paradigms: <a href="#stroop"> StroopTest </a> , <a href="#reaction">ReactionTest </a>, <a href="#matching">MatchingTest </a>. Each program may or may not have lists (depending on how it was defined) and can be changed, deleted or retrieved at any time.</p> <p><img src="https://github.com/lab-neuro-comp/Test-Platform/blob/master/StroopTest/Resources/help_images/programsEN.png?raw=true" alt="programs" /></p> <h4 id="exec">Execution (Run)</h4> <p>To run a program or experiment, you must fill in the data in the toolbar, selecting what will be executed, who will be the participant and what will be the mark.</p> <p><br />The <strong>mark</strong> is a keyboard signal generated by the program at the instant a stimulus is shown, normally used when a program is running in the background in conjunction with the platform, as an example neurospectrum, to collect more accurate data.</p> <p>After completing the entries, simply click on the run button that the test will occur and the results will be generated.</p> <p><img src="https://github.com/lab-neuro-comp/Test-Platform/blob/master/StroopTest/Resources/help_images/execBarEN.png?raw=true" alt="execBar"/></p> <h4 id="results">Results</h4> <p>The results are displayed on pages according to the type of test performed, in tables that can be exported to excel (.csv).</p> <p><img src="https://github.com/lab-neuro-comp/Test-Platform/blob/master/StroopTest/Resources/help_images/results.png?raw=true" alt="results" width="521" height="403" /></p> <p>When an experiment is run, the tables of the experiment and the respective programs that have been run are generated.</p> </div> <div> <h3> </h3> <h4 id="results">Import/Export</h4> <p>If you need to use lists, programs, or experiments on more than one computer, you can export files and import them into the platform by accessing those features in the menu.</p> <div> <h3 id="stroop">StroopTest</h3> <p>It proposes the presentation of elements in sequence with exposure times and scheduled intervals. According to the Stroop paradigm, the presented elements carry some semantic conflict, such as the classic words of colored colors ( <span style="color: #00ff00;">blue </span>). StroopTest offers different categories of stimuli - word, image, audio - that can be combined individually or in pairs promoting the Stroop effect in several different versions.</p> </div> <div> <h3 id="reaction">ReactionTest</h3> <p>It proposes the presentation of elements on screen that must have an interpretation from a response issued by the participant through the keyboard or touch screen. According to the reaction time paradigm, this response must be given as fast as possible, so that the expected response arises from the moment the element is displayed on the screen, and there may be an early response (commission) or there is no response after the display. ReactionTest provides different categories of stimuli - geometric shapes, image, words - that allow the evaluation of reaction time in several different versions.</p> </div> <div> <h3 id="matching">MatchingTest</h3> <p>The matching tests with (or without) Model with Delay,Delay matching or non-matching-to-sample - DMTS / DNMTS are tests widely used in visual memory recognition.</p> <h3 id="update">Platform Updates</h3> <p>If you want to check if your application is up-to-date, check the latest release in here: <a href="https://github.com/lab-neuro-comp/Test-Platform/releases/latest">https://github.com/lab-neuro-comp/Test-Platform/releases/latest</a> </p> <p>You must do the following: </p> <ol> <li>Check the version number in the latest release</li> <li>Check the version number in your application</li> <li>Download the newest version</li> <li>Install it in the same folder of the previous one</li> </ol> <p>Look for the version released: </p> <p><img src="https://github.com/lab-neuro-comp/Test-Platform/blob/master/StroopTest/Resources/help_images/release.png?raw=true" alt="release" /></p> <p>And check your program version to see what is your current:</p> <p> <img src="https://github.com/lab-neuro-comp/Test-Platform/blob/master/StroopTest/Resources/help_images/versionEN.png?raw=true" alt="about" /></p> </div> <h3 id="recommend">Recommendations</h3> <p>For use of the program it is recommended to use Windows 7 operating system or higher. It is also suggested that when using audio recording, use a device that is compatible with your computer and has been previously tested.</p> </div> <div> <h3 id="contact">Want to get in touch?</h3> <p>If you encounter any problems fill out this form: <a href="https://github.com/lab-neuro-comp/Test-Platform/issues/new">https://github.com/lab-neuro-comp/Test-Platform/issues/new</a> reporting what has happened, or send an email to someone responsible for the project. We recommend contacting if you can not get a question or suggestions!</p> <table style="height: 132px; border-color: #000000; width: 627px; float: left;" border="1"> <tbody> <tr> <td style="width: 134.182px;">Name</td> <td style="width: 174.909px;">Assignment</td> <td style="width: 298.545px;">Contact (GitHub/Email)</td> </tr> <tr> <td style="width: 134.182px;">Ana Garcia</td> <td style="width: 174.909px;">Technical Manager</td> <td style="width: 298.545px;">anacog/anacog@pobox.com</td> </tr> <tr> <td style="width: 134.182px;">Fabíola Fleury</td> <td style="width: 174.909px;">Developer</td> <td style="width: 298.545px;">fabiolamfleury/fabiola.mfleury@gmail.com</td> </tr> <tr> <td style="width: 134.182px;">Gabriel Albino</td> <td style="width: 174.909px;">Developer</td> <td style="width: 298.545px;">gabrielalbino/enggabrielalbino@gmail.com</td> </tr> </tbody> </table> </div> <div> <h3> </h3> </div> <div> </div> <p> </p> <p> </p>
pt_br: <h1>TestPlatform</h1> <div> <p>Qual &eacute; a sua d&uacute;vida?&nbsp;</p> <ul> <li><a href="#how"> Como funciona a plataforma </a> <ul> <li><a href="#lists"> Listas </a></li> <li><a href="#programs"> Programas </a></li> <li><a href="#experiments"> Experimentos </a></li> <li><a href="#exec"> Execu&ccedil;&atilde;o </a></li> <li><a href="#results"> Resultados </a></li> <li><a href="#import"> Importa&ccedil;&atilde;o/exporta&ccedil;&atilde;o </a></li> </ul> </li> <li><a href="#stroop"> Stroop </a></li> <li><a href="#reaction"> Tempo de Rea&ccedil;&atilde;o </a></li> <li><a href="#matching"> Teste de Escolha </a></li> <li><a href="#update"> Atualiza&ccedil;&otilde;es da Plataforma</a></li> <li><a href="#recommend"> Recomenda&ccedil;&otilde;es </a></li> <li><a href="#contact"> Gostaria de entrar em contato? </a></li> </ul> </div> <div> <h3 id="how">Como funciona a plataforma</h3> <p>&nbsp;A plataforma &eacute; utilizada para defini&ccedil;&atilde;o, execu&ccedil;&atilde;o e an&aacute;lise de resultados de testes neuropsicol&oacute;gicos dentro de paradigmas pr&eacute; definidos. Ela trabalha com unidades chamadas de listas, programas e experimentos.</p> <p>As <strong> listas </strong> s&atilde;o est&iacute;mulos que s&atilde;o definidos previamente &agrave; realiza&ccedil;&atilde;o do teste, podendo ser palavras, cores, imagens ou audios.</p> <p>Os <strong> programas&nbsp; </strong> s&atilde;o protocolos definidos pelo pesquisador, podendo ser de um dos seguintes tipos de teste: Stroop, Tempo de Rea&ccedil;&atilde;o ou Teste de Escolha. Estes tipos representam diferentes paradigmas.</p> <p>Os <strong> experimentos </strong> &nbsp;s&atilde;o cole&ccedil;&otilde;es de programas, para que possam ser executados em sequ&ecirc;ncia.</p> <p>Cada p&aacute;gina da plataforma possui um bot&atilde;o de ajuda, para que informa&ccedil;&otilde;es espec&iacute;ficas sejam fornecidas. A barra lateral esquerda apresenta as p&aacute;ginas que s&atilde;o naveg&aacute;veis pelo programa.</p> <p>O fluxo a seguir descreve como um programa pode ser criado, executado e ter os seus resultados obtidos na plataforma:</p> <p>&nbsp;</p> <p><img src="https://github.com/lab-neuro-comp/Test-Platform/blob/master/StroopTest/Resources/help_images/procedure.png?raw=true" alt="Fluxogram" width="521" height="403" /></p> <h4 id="lists">Listas</h4> <p>As listas definidas ser&atilde;o utilizadas pelos programas. Escolhe-se o tipo de lista e cria-se ou edita, fornecendo o nome que ser&aacute; referenciado pelo programa e o conte&uacute;do da lista. Para cria&ccedil;&atilde;o da lista de a&uacute;dios &eacute; necess&aacute;rio que o arquivo seja do tipo ".wav", caso desejar, voc&ecirc; pode gravar arquivos de a&uacute;dio na aba de "A&uacute;dios" das listas. Os arquivos de imagens podem ser de tipos diversos (.png, .jpeg, .bmp, dentre outros). As listas de cores ser&atilde;o definidas de acordo com a nomeclatura hexadecimal.</p> <img src="https://github.com/lab-neuro-comp/Test-Platform/blob/master/StroopTest/Resources/help_images/lists.png?raw=true" alt="ListsMenu"/> <h4 id="programs">Programas</h4> <p>Os programas s&atilde;o as configura&ccedil;&otilde;es de um teste podendo ser criados nos seguintes paradigmas:&nbsp; <a href="#stroop"> Stroop </a> , <a href="#reaction"> Tempo de Rea&ccedil;&atilde;o </a> , <a href="#matching"> Teste de Escolha </a> . Cada programa pode ou n&atilde;o ter listas (dependendo de como foi definido) e pode ser alterado, exclu&iacute;do ou recuperado a qualquer momento.&nbsp;</p> <p><img src="https://github.com/lab-neuro-comp/Test-Platform/blob/master/StroopTest/Resources/help_images/programs.png?raw=true" alt="programs" /></p> <h4 id="exec">Execu&ccedil;&atilde;o</h4> <p>Para executar um programa ou experimento, deve-se preencher os dados na barra, selecionando o que ser&aacute; executado, qual ser&aacute; o participante e qual ser&aacute; a marca.</p> <p>A <strong> marca </strong> &eacute; um sinal de teclado gerado pelo programa no instante em que um est&iacute;mulo &eacute; mostrado, utilizado normalmente quando um programa est&aacute; sendo executado no fundo em conjunto com a plataforma, como exemplo o neuronspectrum, para coletar dados mais precisos.</p> <p>Ap&oacute;s o preenchimento das entradas, basta clicar no bot&atilde;o executar que o teste ocorrer&aacute; e os resultados ser&atilde;o gerados.</p> <p><img src="https://github.com/lab-neuro-comp/Test-Platform/blob/master/StroopTest/Resources/help_images/execBar.png?raw=true" alt="execBar"/></p> <h4 id="results">Resultados</h4> <p>Os resultados s&atilde;o exibidos em p&aacute;ginas de acordo com o tipo de teste realizado, em tabelas que podem ser exportadas para excel (.csv).</p> <p><img src="https://github.com/lab-neuro-comp/Test-Platform/blob/master/StroopTest/Resources/help_images/results.png?raw=true" alt="results" width="521" height="403" /></p> <p>Quando um experimento &eacute; executado, s&atilde;o geradas as tabelas, al&eacute;m do experimento, dos respectivos programas que foram executados.</p> </div> <div> <h3>&nbsp;</h3> <h4 id="results">Importa&ccedil;&atilde;o/Exporta&ccedil;&atilde;o</h4> <p>Caso seja necess&aacute;rio utilizar listas, programas ou experimentos em mais de um computador, &eacute; poss&iacute;vel exportar arquivos e export&aacute;-los dentro da plataforma, ao acessar essas funcionalidades no menu.</p> <div> <h3 id="stroop">Stroop</h3> <p><span style="font-weight: 400;"> Prop&otilde;e a apresenta&ccedil;&atilde;o de elementos em sequ&ecirc;ncia com tempos de exposi&ccedil;&atilde;o e intervalos programados.&nbsp; </span> De acordo com o paradigma do Stroop, os elementos apresentados carregam algum conflito sem&acirc;ntico, como o cl&aacute;ssico palavras de cores coloridas ( <span style="color: #00ff00;"> azul </span> ). O StroopTest disponibiliza diferentes categorias de est&iacute;mulos - palavra, imagem, &aacute;udio - que podem ser combinadas individualmente ou em par promovendo o efeito Stroop em diversas e &nbsp;pr&oacute;prias vers&otilde;es.</p> </div> <div> <h3 id="reaction">Tempo de Rea&ccedil;&atilde;o</h3> <p>Prop&otilde;e a apresenta&ccedil;&atilde;o de elementos em tela que devem ter uma interpreta&ccedil;&atilde;o a partir de uma resposta emitida pelo participante atrav&eacute;s do teclado ou toque de tela. De acordo com o paradigma de tempo de rea&ccedil;&atilde;o, essa resposta deve ser dada o mais r&aacute;pido poss&iacute;vel, de modo que a resposta esperada &eacute; surge a partir do momento em que o elemento &eacute; exibido na tela, e pode haver resposta antecipada (comission) ou n&atilde;o haver resposta ap&oacute;s a exibi&ccedil;&atilde;o. O ReactionTest disponibiliza diferentes categorias de est&iacute;mulos - formas geom&eacute;tricas, imagem, palavras - que possibilitam a avalia&ccedil;&atilde;o do tempo de rea&ccedil;&atilde;o em diversas e pr&oacute;prias vers&otilde;es.</p> </div> <div> <h3 id="matching">Teste de Escolha</h3> <p>Os testes de Escolha de Acordo Com o (ou Diferente do) Modelo com Atraso, <br /> Delay matching or non-matching- to-sample &ndash; DMTS/DNMTS, s&atilde;o testes <br /> largamente utilizados no reconhecimento de mem&oacute;ria visual.</p> </div> <h3 id="update">Atualiza&ccedil;&otilde;es da Plataforma</h3> <p>Caso queira conferir se sua aplica&ccedil;&atilde;o est&aacute; atualizada, veja a o &uacute;ltimo lan&ccedil;amento em: &nbsp;<a href="https://github.com/lab-neuro-comp/Test-Platform/releases/latest">https://github.com/lab-neuro-comp/Test-Platform/releases/latest</a>&nbsp;</p> <p>Voc&ecirc; deve seguir os passos:&nbsp;</p> <ol> <li>Verificar o n&uacute;mero de vers&atilde;o do "latest release";</li> <li>Verificar a vers&atilde;o da sua aplica&ccedil;&atilde;o instalada;</li> <li>Baixar a vers&atilde;o mais nova;</li> <li>Instalar na mesma pasta da vers&atilde;o anterior.</li> </ol> <p>Veja a vers&atilde;o do &uacute;ltimo lan&ccedil;amento:&nbsp;</p> <p><img src="https://github.com/lab-neuro-comp/Test-Platform/blob/master/StroopTest/Resources/help_images/release.png?raw=true" alt="release" /></p> <p>E veja a vers&atilde;o do seu programa:</p> <p>&nbsp;<img src="https://github.com/lab-neuro-comp/Test-Platform/blob/master/StroopTest/Resources/help_images/version.png?raw=true" alt="about" /></p> </div> <h3 id="recommend">Recomenda&ccedil;&otilde;es</h3> <p>&nbsp;Para utiliza&ccedil;&atilde;o do programa &eacute; recomend&aacute;vel a utiliza&ccedil;&atilde;o de sistema operacional Windows 7 ou superior. Tamb&eacute;m &eacute; sugerido que na utiliza&ccedil;&atilde;o da grava&ccedil;&atilde;o de a&uacute;dios, seja utilizado um dispositivo que seja compat&iacute;vel com seu computador e que tenha sido previamente testado.</p> <div> <h3 id="contact">Gostaria de entrar em contato?</h3> <p>Caso encontre algum problema preencha este formul&aacute;rio:&nbsp; <a href="https://github.com/lab-neuro-comp/Test-Platform/issues/new"> https://github.com/lab-neuro-comp/Test-Platform/issues/new </a> relatando o ocorrido, ou envie um email para algum dos respons&aacute;veis pelo projeto. Recomendamos entrar em contato caso n&atilde;o consiga tirar uma d&uacute;vida, ou tamb&eacute;m tenha sugest&otilde;es!</p> <table style="height: 132px; border-color: #000000; width: 627px; float: left;" border="1"> <tbody> <tr> <td style="width: 134.182px;">Nome</td> <td style="width: 174.909px;">Atribui&ccedil;&atilde;o</td> <td style="width: 298.545px;">Contato (GitHub/Email)</td> </tr> <tr> <td style="width: 134.182px;">Ana Garcia</td> <td style="width: 174.909px;">Respons&aacute;vel T&eacute;cnico</td> <td style="width: 298.545px;">anacog/anacog@pobox.com</td> </tr> <tr> <td style="width: 134.182px;">Fab&iacute;ola Fleury</td> <td style="width: 174.909px;">Desenvolvedora</td> <td style="width: 298.545px;">fabiolamfleury/fabiola.mfleury@gmail.com</td> </tr> <tr> <td style="width: 134.182px;">Gabriel Albino</td> <td style="width: 174.909px;">Desenvolvedor</td> <td style="width: 298.545px;">gabrielalbino/enggabrielalbino@gmail.com</td> </tr> </tbody> </table> </div> <div> <h3>&nbsp;</h3> </div> <div>&nbsp;</div> <p>&nbsp;</p> <p>&nbsp;</p>
