Repository: lab-neuro-comp/Test-Platform
Catalog: StroopTest/Resources/Localizations/LocalizedResources.*.resx
Languages: es_es, pt_br

# activeAudio
source: Active audio recording during test execution
es_es: Activa captura de audio durante la presetación de los estímulos
pt_br: Ativa captura de áudio durante a execução do teste

# audioFile
source: Audio list file
es_es: Archivo de Lista de audio
pt_br: Arquivo de Lista de áudio

# audioList
source: Audio Lists:
es_es: Listas de Audio:
pt_br: Listas de Audio:

# audioRecordSuccess
source: Successfully recorded audio.
es_es: Audio grabado con éxito.
pt_br: Aúdio gravado com sucesso!

# backgroundColor
source: Background color to stimuli presentation
es_es: Color de hondo durante la presetación de los estímulos
pt_br: Cor de fundo durante a apresentação dos estímulos

# beepDuration
source: Beep should last longer than 0 milliseconds.
pt_br: O beep deve durar mais do que 0 milissegundos

source: choose
pt_br: escolher

# colorFile
source: Color list file
es_es: Archivo de Lista de colores
pt_br: Arquivo de Lista de cores

source: Colors
es_es: de Colores
pt_br: de Cores

source: Colors List
es_es: Lista de Colores
pt_br: Lista de Cores

# colorWords
source: Word color for image and word expositions
es_es: Color de la palabra, para exposición del tipo Imagen y Palabra
pt_br: Cor da palavra, para exposição do tipo Imagem e Palavra

# couldntEdit
source: Could not edit program
pt_br: Edição não pode ser feita

source: default
pt_br: padrao

# description
source: The TestPlatform is a platform of computerized neuropsychological tests for the evaluation of executive functions. The product has the proposal to offer solutions innovating technologically in a practical and dynamic way. Intended for researchers, students and ordinary users. Technical Manager: anacog@pobox.com - Ana Garcia Developers: hugohon - Hugo Honda Ferreira fabiolamfleury - Fabíola Malta Fleury gabrielalbino - Gabriel Batista Albino Silva; 2018; More information: https://github.com/lab-neuro-comp/Test-Platform
es_es: El TestPlatform es una plataforma de testes neuropsicológico computadorizado para evaluación de funciones ejecutivas. El produto tiene la propuesta ofrecer soluciones innovando tecnologicamente de forma práctica y dinámica. Destinado a pesquisadores, alumnos e usuários comunes. Responsable Técnico: anacog@pobox.com - Ana Cog Desenvolvedores: hugohon - Hugo Honda Ferreira fabiolamfleury - Fabíola Malta Fleury gabrielalbino - Gabriel Batista Albino Silva; https://github.com/lab-neuro-comp/Test-Platform 2018;
pt_br: O TestPlatform é uma plataforma de testes neuropsicológicos computadorizados para avaliação de funções executivas. O produto tem a proposta oferecer soluções inovando tecnologicamente de forma prática e dinâmica. Destinado a pesquisadores, alunos e usuários comuns. Responsável Técnico: anacog@pobox.com - Ana Garcia Desenvolvedores: hugohon - Hugo Honda Ferreira fabiolamfleury - Fabíola Malta Fleury gabrielalbino - Gabriel Batista Albino Silva; 2018; Mais informações: https://github.com/lab-neuro-comp/Test-Platform

source: Edit Program:
es_es: Editar el programa:
pt_br: Editar Programa:

# emptyBox
source: Text field can't be empty.
es_es: Caja de texto no puede estar vacía.
pt_br: A caixa de texto não pode estar vazia!

# emptyList
source: The list is empty!
es_es: Lista vacía.
pt_br: A lista está vazia!

# emptyListName
source: The list name must be filled in.
es_es: El nombre de la lista debe ser rellenado
pt_br: O nome da lista deve ser preenchido.

# exclude
source: Delete:
es_es: Eliminar:
pt_br: Excluir:

# exclusionSucceeded
source: delete succeeded!
es_es: eliminado con éxito
pt_br: excluída com sucesso!

# expandImages
source: Expand image to fill screen
es_es: Expande la imagen hasta las orilla de la pantalla
pt_br: Expande a imagem até as bordas da tela

source: Experiment
es_es: Experimento
pt_br: Experimento

# experimentFiles
source: Path for experiments data is invalid.
es_es: Camino para los archivos de datos inválido
pt_br: Caminho para os arquivos de dados de experimentos inválido.

# expoCancel
source: Exposition was cancelled.
pt_br: A exposição foi cancelada.

# expoNumber
source: Exposition number must be greater than zero.
pt_br: O número de exposições deve ser maior do que zero.

# expoRandomize
source: Random stimulus exposition according to list
es_es: Exposición de los estímulos en orden aleatoria en relación a la lista
pt_br: Exposição dos estímulos em ordem aleatória em relação à lista

# exportedFile
source: File exported successfully!
es_es: Archivo exportado con éxito
pt_br: Arquivo exportado com sucesso!

# expositionDuration
source: Exposition duration for each stimulus
es_es: Duración de la exposición de cada estímulo
pt_br: Duração da exposição de cada estímulo

# expoTime
source: Exposition time must be greater than zero.
pt_br: O tempo de exposição deve ser maior do que zero.

# expoType
source: Exposition type:
pt_br: Tipo de Exposição:

# fieldNotRight
source: Some field was not filled in correctly.
es_es: Algún campo no fue rellenado correctamente
pt_br: Algum campo não foi preenchido de forma correta.

source: File
es_es: Archivo:
pt_br: Arquivo:

source: Fix point color
es_es: Color del punto de fijación
pt_br: Cor do ponto de fixação

# fixpointEx
source: Fix point: cross or point
es_es: Tipo de punto de fijación: cruz o punto
pt_br: Tipo de ponto de fixação: cruz ou ponto

# fontSize
source: Font size to the following exposition types: word, word with audio and image with word
es_es: Tamaño de la fonte del texto, para exposición del tipo Palabra, Palabra con audio, Imagen y palabra
pt_br: Tamanho da fonte do texto, para exposição do tipo Palavra, Palavra com áudio, Imagem e palavra

source: Help
pt_br: Ajuda

# imageFile
source: Image list file
es_es: Archivo de Lista de imágenes
pt_br: Arquivo de Lista de imagens

# imageFileError
source: Couldn't show image. You don't have permission to access this file or it can be corrupted.\n
es_es: No se puede presentar la imágen. Usted no tiene permiso para leer este archivo o el archivo está corrompido
pt_br: Não pode apresentar a imagem. Você pode não ter permissão para ler este arquivo ou ele pode estar corrompido.\n

# imageList
source: Image Lists:
es_es: Lista de imágenes:
pt_br: Lista de Imagens:

# instructionBox
source: Write each of the instructions on separate lines.
pt_br: Escreva cada uma das intruções em linhas separadas.

# instructionBoxText
source: The participant must be clearly and uniformly oriented to test execution accordingly to participant group and experiment team.<br><br>For classic Stroop Test basic instructions are: <br>'In this task you must speak the name of the color in which the words are painted.'<br>or<br>'In this task you should read the word displayed on the screen.'
es_es: El participante debe ser orientado para ejecución de forma clara y uniforme entre los experimentares y el grupo de participantes.<br><br>Para el Stroop clásico las instruciones básicas practicadas son:<br>'En esta tarea usted debe hablar el nombre de la color en que las palabras estan pintadas.'<br>o<br>'En esta tarea usted debe leer la palabra presentada en la pantalla.'
pt_br: O participante deve ser orientado para execução de forma clara e uniforme entre os experimentares e o grupo de participantes.<br><br>Para o Stroop clássico as instruções básicas praticadas são:<br>'Nesta tarefa você deve falar o nome da cor em que as palavras estão pintadas.'<br>ou<br>'Nesta tarefa você deve ler a palavra apresentada na tela.'

# instructionsI
source: Instructions to be shown before test starts, each line will be shown in one screen
es_es: Instruciones presentadas al inicio del programa - sera presentada una pantalla para cada línea escrita abajo
pt_br: Instruções apresentadas no início do programa - será apresentada um tela para cada linha escrita abaixo

# intervalsTime
source: Time between each attempt
es_es: Tiempo entre los intentos
pt_br: Tempo entre as tentativas

# intervalsTimeRandom
source: Variation of time between attempts
es_es: Variación del tiempo entre los intentos
pt_br: Variação do tempo entre as tentativas

# intervalTime
source: Interval time must be greater than zero.
pt_br: O tempo de intervalo deve ser maior do que zero.

source: invalid
pt_br: inválido

# invalidExpoType
source: Exposition type is invalid!
pt_br: Tipo de Exposição inválido!

# invalidPath
source: is an invalid path.
es_es: es un camino inválido
pt_br: é um caminho inválido!

# list
source: The list '
es_es: La lista '
pt_br: A lista '

# listExists
source: A list with this name already exists. \n Do you want to overwrite it?
es_es: Una lista con este nombre ya existe.\nDesea sobrescribirla?
pt_br: Uma lista com este nome já existe.\nDeseja sobrescrevê-la?

# listNotSaved
source: The list won't be saved.
es_es: La lista no será guardada
pt_br: A lista não será salva

# listSaveSuccess
source: ' was save successfully
es_es: fue salva com éxito
pt_br: ' foi salva com sucesso

# markLengthError
source: Field mark must be filled.
es_es: Campo de la marca debe ser rellenado
pt_br: O campo da marca deve ser preenchido.

# markLengthError2
source: Mark must be expressed by one character only
es_es: La marca debe ser compuesta solamente de un caracter
pt_br: A marca deve ser composta apenas de um caracter

source: None
es_es: Nigún
pt_br: Nenhum

# notEdit
source: Program couldn't be edited.
pt_br: Edição não pode ser feita.

# notFilledProperlyMessage
source: Some field was not filled in correctly.
es_es: Algún campo no fue rellenado de forma correcta.
pt_br: Algum campo não foi preenchido de forma correta.

# notFoundIn
source: \nwasn't found in location:\n
es_es: \nno fue encontrado en el local:\n
pt_br: \nnão foi encontrado no local:\n

# numberExpositions
source: Number of times that stimulus will be exposed
es_es: Número de veces en que los estímulos serán expuesto
pt_br: Número de vezes em que os estímulos serão expostos

# participantNameAlphanumericError
source: Nome do participante deve ser composto apenas de caracteres alphanumericos e sem espaços;\nExemplo: 'LuisAugusto'"
es_es: Nombre del participante debe ser compuesto solamente de caracteres alfanuméricos y sin espacios;\nEjemplo: 'LuisAugusto'"
pt_br: O texto deve ser composto apenas de caracteres alfanuméricos e sem espaços;\nExemplo: 'LuisAugusto'"

# participantNameLengthError
source: Participant name must be filled.
es_es: El nombre del participante debe ser rellenado.
pt_br: O nome do participante deve ser preenchido.

# positionInvalid
source: Number of stimulus positions is invalid, must be one of the following values: 1, 2, 4 or 8."
pt_br: Quantidade de posições do estímulo inválidas, deve ser um dos seguintes valores: 1, 2, 4 ou 8.

# programEdit
source: The program contains incorrect parameters and / or is incomplete! \nCorrect the program in the following interface.
pt_br: O programa contém parâmetros incorretos e/ou está incompleto!\nCorrija o programa na interface a seguir.

# programExists
source: A program with this name already exists. \n Do you want to overwrite it?
pt_br: O programa já existe, deseja sobrescrevê-lo?

# programNotAlphanumeric
source: The program name must be composed only of alphanumerical characters and no spaces; \ nExample: 'MyProgram'
es_es: Nombre del programa debe ser compuesto solamente de caracteres alfanuméricos y sin espacios;\nEjemplo: 'MeuPrograma'"
pt_br: Nome do programa deve ser composto apenas de caracteres alfanuméricos e sem espaços;\nExemplo: 'MeuPrograma'"

# programNotFilled
source: The program name must be filled in.
es_es: El nombre del programa debe ser rellenado.
pt_br: O nome do programa deve ser preenchido.

# programNotSave
source: Program wil not be saved.
pt_br: O programa não será salvo!

# programSave
source: Program saved.
es_es: Programa guardado con éxito
pt_br: O programa foi salvo com sucesso.

# programSaved
source: Program was saved with successfully
es_es: Programa guardado con éxito
pt_br: O programa foi salvo com sucesso

source: ReactionTest
es_es: Tiempo de Reacción
pt_br: Tempo de Reação

# reallyExclude
source: Do you really want to delete
es_es: Desea realmente eliminar
pt_br: Deseja realmente excluir

# selectDataFile
source: Select a data file!
es_es: Seleccione un archivo de datos!
pt_br: Selecione um arquivo de dados!

# selectImage
source: You must select the image list file.
pt_br: Selecione o arquivo de lista de imagem.

# selectPlace
source: Select file destination before recording
es_es: Debe elegir el local del archivo antes de grabar
pt_br: É necessário selecionar o local do arquivo antes de gravar.

# selectTraining
source: Select a training program!
es_es: Elija un programa para su entrenamiento!
pt_br: Selecione um programa para ser seu treino!

source: StroopTest
es_es: Stroop
pt_br: Stroop

# subtitleActive
source: Active subtitles for image type
es_es: Activa leyenda para estímulos del tipo imagen
pt_br: Ativa legenda para estímulos do tipo imagem

# subtitleColor
source: Subititle color
es_es: Color de la leyenda presentada
pt_br: Cor da legenda apresentada

# subtitlePosition
source: Subtitle position in relation to stimuli
es_es: Posicionamento de la leyenda en relación a los estímulos
pt_br: Posicionamento da legenda em relação aos estímulos

source: Test name
es_es: Nombre del esquema de presentación de estímulo
pt_br: Nome do esquema de apresentação de estímulos

# typeStimulus
source: Program stimulus category
es_es: Categoria de los estímulos del programa
pt_br: Categoria dos estímulos do programa

# unavailableExpo
source: Exposition type currently unavailable.
pt_br: Tipo de exposição ainda não está disponível.

# validColor
source: 'contains invalid values! \ n The' color list must contain only hexadecimal values (example: # 000000)
pt_br: ' contém valores inválidos!\n A lista de "cores deve conter apenas valores hexadecimais (ex: #000000)

# wishToSave
source: Do you want to save the file
es_es: Desea guardar el archivo
pt_br: Deseja salvar o arquivo

# wordColorList
source: Words with Colors List
es_es: Lista de Palabras con Colores
pt_br: Lista de Palavras com Cores

# wordFile
source: Word list file
es_es: Archivo de Lista de palabras
pt_br: Arquivo de Lista de palavras

# wordList
source: Word Lists:
es_es: Lista de Palabras:
pt_br: Listas de Palavras:

source: Words
es_es: de Palabras
pt_br: de Palavras

source: Words List
es_es: Lista de Palabras
pt_br: Lista de Palavras

# colorMatch
source: Color doesn't follow hexadecimal pattern: #000000
pt_br: A cor não segue o padrão hexadecimal: #000000

# exportDirectory
source: Select a valid directory where there is no export from the platform
pt_br: Selecione um diretório válido onde ainda não há nenhuma exportação da plataforma

# fileNotFound
source: Couldn't find file on path:
pt_br: Não foi possível encontrar o arquivo no caminho:

# lists
source: List
pt_br: Lista

# removeItem
source: You must select item to be removed from list.
pt_br: Selecione um arquivo para remover da lista.

# selectAudio
source: You must select the audio list file.
pt_br: Selecione o arquivo de lista de aúdios.

# selectColor
source: You must select the color list file.
pt_br: Selecione o arquivo de lista de cores.

# selectWord
source: You must select the word list file.
pt_br: Selecione o arquivo de lista de palavras.

# experimentHeader
source: experiment\tprogram\tProgram Type\t#\tParticipant\tdate\tInitial time\tTest time\tSequence
pt_br: experimento\tprograma\ttipo Programa\t#\tParticipante\tdata\thorario Inicial\thorario Teste\tsequencia

# experimentName
source: The experiment name must be composed only of alphanumerical characters and no spaces; \ nExample: 'MyExperiment'
pt_br: Nome do experimento deve ser composto apenas de caracteres alfanuméricos. \nExemplo: 'MeuExprimento'.

# import
source: Files were imported sucessfully.
pt_br: Arquivos importados com sucesso.

# intervalInvalid
source: \n Interval time between programs must be equal to zero or greater (miliseconds).
pt_br: \nTempo de intervalo entre programas deve ser maior ou igual a zero (em milissegundos)

# parameter
source: File parameter written:
pt_br: Parâmetro escrito no arquivo como: '

# parameterShould
source: \n should be:
pt_br: '\ndeveria ser igual ao nome no arquivo: '

# audioConfigInstructions
source: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">General</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Option</th> <th class = "subBar">Description</th> </tr> <tr> <td>List name</td> <td>Sets the name of the list that will be chosen in the program definition. It is recommended that the list name characterize the chosen set of elements and the step comprising, for example, "Victoria1". The order in which the elements are informed will be kept in the respective list.</td> </tr> <tr> <th class = "mainBar" colspan = "2">Audio list creation</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Option</th> <th class = "subBar">Description</th> </tr> <td>Audios</td> <td>Selects the folder containing the audio files to be placed in the list by the "Open" button.</td> </tr> </tr> <td>Delete Item</td> <td>Excludes from the list the selected audio file with the "Delete" button.</td> </tr> </tr> <td>Move Item</td> <td>Repositions the selected audio file in the list with the "Up" and "Down" buttons.</td> </tr> </tr> <td>Play audio</td> <td>Represents the selected audio file using the computer's active sound devices. The selected File Name is displayed in the list and Location</td> </tr> </tr> </table> </body> </html>
pt_br: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Geral</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Nome da Lista</td> <td>Define o nome da lista que será escolhida na definição do programa. É recomendável que o nome da lista caracterize o conjunto de elementos escolhido e a etapa que compreende, por exemplo, “Victoria1”. A ordem em que os elementos são informados será mantida na respectiva lista.</td> </tr> <tr> <th class = "mainBar" colspan = "2">Criação da lista de áudios</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <td>Áudios</td> <td>Seleciona a pasta que contém os arquivos de áudio a serem colocados na lista pelo botão “Abrir”.</td> </tr> </tr> <td>Apagar Item</td> <td>Exclui da lista o arquivo de áudio selecionado com o botão “Apagar”.</td> </tr> </tr> <td>Mover Item</td> <td>Reposiciona o arquivo de áudio selecionado na lista com os botões “Acima” e “Abaixo”.</td> </tr> </tr> <td>Reproduzir áudio</td> <td>Representa o arquivo de áudio selecionado utilizando os dispositivos de som ativos do computador. Na lista são apresentados o Nome do Arquivo escolhido e a Localização</td> </tr> </tr> </table> </body> </html>

# imageConfigInstructions
source: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">General</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Option</th> <th class = "subBar">Description</th> </tr> <tr> <td>Name</td> <td>Sets the name of the list that will be chosen in the program definition. It is recommended that the list name characterize the chosen set of elements and the step comprising, for example, "Victoria1". The order in which the elements are informed will be kept in the respective list."</td> </tr> <tr> <th class = "mainBar" colspan = "2">List options</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Option</th> <th class = "subBar">Description</th> </tr> <td>Images</td> <td>Selects the folder containing the images to be inserted in the list by the "Open" button.</td> </tr> <tr> <td>Delete Item</td> <td>Excludes from the list the image file selected with the "Delete" button.</td> </tr> <tr> <td>Move Item</td> <td>Moves the item on the list.</td> </tr> </table> </body> </html>
pt_br: <!DOCTYPE html> <html> <head> <style> table { width:100%; } table, th, td { border: 1px solid black; border-collapse: collapse; } th, td { padding: 5px; text-align: justify; } table#t01 tr:nth-child(even) { background-color: #eee; } table#t01 tr:nth-child(odd) { background-color:#fff; } .subBar { background-color: gray; color: black; } .mainBar{ background-color: black; color: white; text-align: center; } li{ padding-bottom:5px; } </style> </head> <body> <table id="t01" style = "margin: 0 auto; padding: 0"> <tr> <td colspan = "2" style = "background: #fff"> </td> </tr> <th class = "mainBar" colspan = "2">Geral</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <tr> <td>Nome</td> <td>Define o nome da lista que será escolhida na definição do programa. É recomendável que o nome da lista caracterize o conjunto de elementos escolhido e a etapa que compreende, por exemplo, “Victoria1”. A ordem em que os elementos são informados será mantida na respectiva lista." </tr> <tr> <th class = "mainBar" colspan = "2">Opções da lista</th> </tr> <tr> <th class = "subBar" style = "width: 30%" >Opção</th> <th class = "subBar">Descrição</th> </tr> <td>Imagens</td> <td>Seleciona a pasta que contém as imagens a serem inseridos na lista pelo botão “Abrir”.</td> </tr> <tr> <td>Apagar Item</td> <td>Exclui da lista o arquivo de imagem selecionado com o botão “Apagar”.</td> </tr> <tr> <td>Mover Item</td> <td>Move o arquivo na lista.</td> </tr> </table> </body> </html>
